[
    {
        "satellite-view/0001/0.png": "This is an aerial image of a modern building complex surrounded by greenery and water. The central structure is a large, angular building with flat roofs and geometric patterns, featuring an open courtyard and walkways. To the left, a narrow river flows alongside a lush, tree-covered area, while a smaller pink-roofed building sits within the green space. On the right, a road with a crosswalk and a few vehicles runs alongside the property. In the background, parts of a larger urban area with more roads and buildings are visible. The scene appears clear and bright, suggesting a sunny day with no clouds, giving the image a calm and orderly feel. The integration of nature and architecture creates a balanced urban environment."
    },
    {
        "satellite-view/0002/0.png": "This is an aerial image of a large, modern building surrounded by lush greenery and a curved waterway. The building has a rectangular shape with a flat roof and appears to be made of concrete and glass. It is located in the center of the image, with a circular driveway and a few paved areas in front. To the left, there is a dark, winding river bordered by dense trees, and further left, a smaller structure with a flat roof can be seen. On the right side, a wide tree-lined street runs parallel to the building, with a few cars visible. The area is filled with neatly arranged green lawns and tall trees, giving it a calm and orderly appearance. The weather appears clear, with no clouds or shadows, suggesting a bright and sunny day."
    },
    {
        "satellite-view/0003/0.png": "This is an aerial image of a modern educational or research center surrounded by water. At the center is a large building with a grid-like facade and a flat roof, connected to a circular, open-air structure resembling an observatory or amphitheater. A road crosses over a river via a straight bridge, linking the complex to the surrounding area. To the left, a patch of undeveloped land with dirt and a blue-roofed structure can be seen, while green trees line the riverbanks. On the right, a patterned courtyard or plaza extends from the main building. The scene is calm and orderly, with clear skies and bright, even sunlight casting soft shadows, suggesting a peaceful, well-planned environment."
    },
    {
        "satellite-view/0004/0.png": "This is an aerial image of a sports complex. At the center is a green football field surrounded by a red running track. To the right of the field is a large curved stadium with a white roof, resembling a modern architectural design. On the left side of the track, smaller buildings and covered areas are visible, possibly for storage or changing rooms. A row of tennis courts lies in front of the stadium. The entire area is surrounded by lush green trees and bushes, creating a natural border. A road runs along the bottom edge of the image, and a body of water, possibly a river, is just below that. The scene is bright and clear, with no signs of rain or fog, and the overall atmosphere is calm and orderly."
    },
    {
        "satellite-view/0005/0.png": "This is an aerial image of a modern building complex surrounded by green space and water. The central structure is a long, blocky building with a flat roof and multiple wings, featuring a light-colored facade and several smaller roof structures. To the left of the building are two reddish tennis courts with white lines, set within a grassy area. A curved body of water runs along the right side of the image, with a small circular patch of greenery and a paved area nearby. A paved path follows the water’s edge, winding through trees and vegetation. In the upper right, a portion of another building with a dark roof is visible. The weather appears clear, with bright, even lighting suggesting a sunny day, giving the scene a calm and orderly atmosphere. The green trees and still water contribute to a peaceful and well-maintained environment."
    },
    {
        "satellite-view/0006/0.png": "This is an aerial image of a modern architectural complex surrounded by greenery and water. The central structure consists of several rectangular buildings with flat roofs, arranged in a semi-circular layout around a large open area. A circular building with a domed roof sits at the center of this arrangement, resembling a focal point or a pavilion. To the left, a body of calm water curves along the edge of the property, bordered by trees and shrubs. The surrounding landscape is lush and well-maintained, with expansive green lawns and small pathways connecting the buildings. The scene is captured under clear skies, with bright, even light illuminating the area, giving it a crisp and orderly appearance. The overall impression is one of tranquility and design, blending structure and nature harmoniously."
    },
    {
        "satellite-view/0007/0.png": "This is an aerial image of a traditional courtyard complex surrounded by modern structures. In the center is a large, open courtyard with a small temple or pavilion at its heart, flanked by long, dark-roofed buildings arranged symmetrically. To the left, green patches and a road with light traffic frame the scene. On the right, a reflective waterway runs alongside a large, circular building with a dome-like roof, possibly a modern cultural center. The area appears peaceful and orderly. The sunlight is bright, casting soft shadows and highlighting the contrast between the old and new architecture. The overall feel is calm and balanced, with a sense of cultural harmony."
    },
    {
        "satellite-view/0008/0.png": "This is an aerial image of a large traditional-style building complex near a body of water. The buildings have dark tiled roofs and are arranged in a symmetrical, enclosed layout with courtyards and green spaces in the center. Winding paths and manicured trees and shrubs form a garden area between the structures. To the left, a wide river runs alongside the complex, while to the right and above, a road with light traffic and modern buildings can be seen. The scene appears calm and well-organized, captured under clear, bright daylight that highlights the contrast between the natural greenery and the built environment."
    },
    {
        "satellite-view/0009/0.png": "This is an aerial image of a unique building complex surrounded by green space and water. The central structure features several large, rounded domes made of brown materials, resembling a cluster of connected mushrooms or bean pods, and it sits at the center of a patterned plaza with a network of walkways. To the left and right, a narrow canal curves around the building, with patches of lush green grass and trees along its banks. Beyond the immediate area, a road with vehicles runs horizontally across the top of the image, and behind it lies a neighborhood of grey-roofed houses. The sky is clear, and the scene is brightly lit, casting soft shadows that suggest a sunny day. The overall impression is calm and orderly, with the building standing out as a modern, naturalistic design in a quiet, structured environment."
    },
    {
        "satellite-view/0010/0.png": "This is an aerial image of a modern urban complex surrounded by greenery. In the center, a large dark building with multiple rectangular structures extends horizontally, featuring a paved courtyard and narrow walkways. To the left, a wide road with a bridge crosses over, leading to a parking area with cars. The right side shows more buildings and lush trees forming a natural border. Smaller hedges and grass areas are neatly arranged around the main structure, creating a balanced and organized layout. The sunlight is bright, casting sharp shadows that emphasize the geometric shapes of the buildings and roads. The overall scene appears orderly and well-planned, reflecting a clean and modern environment."
    },
    {
        "satellite-view/0011/0.png": "This is an aerial image of a large park area with buildings and greenery. In the center, there is a large building surrounded by trees, with a smaller structure nearby. To the left of this central building, there is a smaller building with a circular garden in front of it. On the right, there are more buildings, including a large one with a flat roof. A dense patch of trees is visible to the right of the central area, creating a green space. The area is surrounded by roads, some with trees lining them. The image shows no people or vehicles, giving it a calm and quiet feel. The weather appears clear, with no signs of rain or fog, and the bright green trees suggest it is likely spring or summer. The overall atmosphere is peaceful and orderly."
    },
    {
        "satellite-view/0012/0.png": "This is an aerial image of a modern building complex surrounded by greenery. In the center, there is a large rectangular structure with a flat roof, likely a sports hall or gymnasium, adjacent to a circular building with a dome-like roof that could be a pavilion or exhibition space. To the right, there are smaller buildings with flat roofs and open areas with patterns of green and brown, possibly gardens or plant beds. On the left, a road runs parallel to the complex, lined with trees and bushes. At the bottom right, a sports field with marked courts and a small red and green area suggests recreational use. The scene is captured under bright, clear skies with sharp shadows, indicating sunny weather. The overall atmosphere is orderly and functional, with a balance of built structures and natural elements."
    },
    {
        "satellite-view/0013/0.png": "This is an aerial image of a large, traditional-style building surrounded by water and greenery. The building has a dark roof with multiple courtyards and wings, and a long, modern-looking extension in front. A curved canal flows around the building, with a green embankment on the side facing the viewer, where golden Chinese characters are visible. Trees grow along the banks of the canal and on the surrounding land. On the left and right of the building, open areas appear as light brown dirt or pathways. The overall scene has a peaceful and orderly atmosphere, with bright daylight and clear visibility. The combination of traditional architecture, water, and lush green space creates a balanced and calm environment."
    },
    {
        "satellite-view/0014/0.png": "This is an aerial image of a campus-like area with greenery and buildings. In the center, a long modern building with a flat roof and large windows stands out, surrounded by trees and paved paths. To the upper left, there are several outdoor tennis and basketball courts, clearly marked with white lines. The lower part of the image shows a cluster of buildings with dark roofs, possibly dormitories or classrooms. A circular pattern of trees appears to form a landscaped courtyard near the central building. The area is covered in lush green trees, giving it a peaceful, natural feel. The image is clear, suggesting a sunny day with no clouds, and the overall atmosphere is calm and orderly."
    },
    {
        "satellite-view/0015/0.png": "This is an aerial image of a modern architectural complex surrounded by green trees and roads. The central object is a large building with two prominent curved structures, one featuring a glass curtain wall and the other a smooth, light-colored dome. These structures are connected by a flat, entrance area with a geometric design and small green patches. To the left, a road runs parallel to the complex, while to the right, another road curves past a grid of trees. The scene is well-lit with clear sunlight, casting distinct shadows. The overall atmosphere is calm and orderly, emphasizing the clean lines and symmetry of the modern design. The surrounding greenery adds a natural contrast to the white and gray tones of the building."
    },
    {
        "satellite-view/0016/0.png": "This is an aerial image of a large, oval-shaped stadium with a reddish-brown track surrounding a green field, located in an urban area. The stadium is surrounded by a blue and purple outer ring and appears to be built within a concrete structure. To the left, a multi-lane road runs parallel to the stadium with a steady flow of traffic, including cars and a few buses. Adjacent to the road is a busy intersection with a small building and a covered structure nearby. On the right side, there are several built-up areas with smaller buildings and a paved parking lot. Green patches of trees and shrubs are scattered around the stadium and roads, giving a slight sense of nature in the environment. The image is taken on a clear day, with bright lighting and no clouds, suggesting it is midday. The overall atmosphere is calm and orderly, reflecting a well-planned city space."
    },
    {
        "satellite-view/0017/0.png": "This is an aerial image of a modern recreational and sports complex surrounded by greenery. In the center, a large circular building with a curved roof stands out, likely a performance hall or arena, featuring a flat white section and dark flat roof areas. To the left of the building, there’s a long structure with a grey roof, possibly a gymnasium or hall, next to a set of tennis courts enclosed by low green fences. A wide road runs vertically, separating the buildings from the park area. The complex is surrounded by lush trees and landscaped gardens with winding paths, creating a calm mix of nature and architecture. A body of water borders the right and bottom of the scene. The image is taken on a clear day with bright sunlight, casting soft shadows and highlighting the greenery. The overall atmosphere is bright and peaceful, with a balanced blend of activity and natural serenity."
    },
    {
        "satellite-view/0018/0.png": "This is an aerial image of a modern building complex surrounded by greenery and paved roads. At the center is a large rectangular structure with a flat roof, featuring several smaller roofs and open spaces. To the left, there is a block with a traditional design and a nearby parking area, while to the right, a forested area provides a natural contrast. Below the building, a curved walkway leads to a small round structure near a calm pond, surrounded by neatly arranged shrubs. The scene is bright and clear under sunny skies, with no clouds visible. The overall atmosphere is orderly and functional, suggesting a well-planned campus or institutional area."
    },
    {
        "satellite-view/0019/0.png": "This is an aerial image of a large, modern building complex surrounded by green trees and open land. The central structure features a long, rectangular main building with a flat roof covered in solar panels, flanked by smaller wings on both sides. To the left, a curved, low-rise section contains several rounded windows, while to the right, a similar structure extends outward with angled sides and large glass windows. A wide courtyard lies between the buildings, with a paved walkway cutting through the middle. The surrounding area is mostly open, with patches of grass and dirt, and the trees provide a natural contrast to the clean lines of the architecture. The weather is clear and bright, with even lighting and no shadows, creating a calm and orderly atmosphere."
    },
    {
        "satellite-view/0020/0.png": "This is an aerial image of a symmetrical urban garden surrounded by buildings and streets. In the center is a circular plaza with a shallow basin, surrounded by green hedges shaped into flowing patterns, creating a leaf-like design. The garden is bordered by wide pathways and flanked by smaller green areas. To the left, there is a parking lot and a large building with a flat roof, while the right side includes more structured landscaping and roadways. At the bottom, a modern building with a flat roof and a green-roofed extension is visible. The top of the image shows a row of trees lining a quieter street. The scene is captured during clear daylight with bright, even lighting, giving the area a calm and orderly appearance."
    },
    {
        "satellite-view/0021/0.png": "This is an aerial image of a quiet landscape featuring a large body of water and adjacent structures. On the left side, the dark, still lake is surrounded by green trees and uneven land covered with shrubs. In the center, a long, low building with a red roof sits near the water’s edge, connected by a narrow path. To the right, a modern complex with flat rooftops and rooftop equipment stands on a paved area, partially bordered by a walkway and small patches of grass. The scene appears calm and orderly under bright, clear conditions, with no signs of activity or people. The contrasting textures of greenery, water, and built structures give the area a balanced and neatly organized look."
    },
    {
        "satellite-view/0022/0.png": "This is an aerial image of a city block with roads, buildings, and green spaces. In the center, there is a large conventional structure surrounded by a hexagonal plaza and parked cars. A large circular building with a dome sits to the right, next to a parking lot filled with cars and a little green spot, possibly a small park. To the left, there are several smaller buildings with green roofs and gardens. Above, a highway runs from left to right, with a walkway spanning across it, showing traffic stripes and edges. To the far right, more vehicles move along roads in a built-up area. The image is clear and shows details evenly, though there is no direct sunlight or shadows. It looks like a normal daytime scene with quiet streets and people going about their daily lives, with no strong emotional tone. The green trees and paved roads stand in contrast, creating a neat and structured urban atmosphere. Overall, it's a clean and organized city section."
    },
    {
        "satellite-view/0023/0.png": "This is an aerial image of a residential neighborhood. In the center, several low-rise buildings with flat roofs are arranged in rows, surrounded by scattered green trees and small gardens. To the left, a wide road runs vertically, with vehicles visible, and a large open area below it. On the right, more homes are clustered with winding paths and driveways. A railway line runs along the top edge of the image, separate from the housing. The area appears well-maintained, with a calm and organized layout. The weather is clear, and sunlight illuminates the scene evenly, casting soft shadows. The overall impression is of a quiet, structured, and peaceful community."
    },
    {
        "satellite-view/0024/0.png": "This is an aerial image of a modern building complex surrounded by water and green space. The central structure consists of long, rectangular buildings with reddish-brown roofs, arranged in a staggered, U-like shape. To the left, a wide, calm waterway flows along the edge of the complex, bordered by dense green trees and shrubs. On the right, another body of water curves around the site, with more traditional-style buildings featuring curved roofs. A paved walkway or road runs alongside the complex, connecting it to the outside. The overall layout appears clean and organized, with a mix of natural and man-made elements. The weather is clear, with bright lighting and no signs of rain or fog, giving the scene a calm and orderly feel."
    },
    {
        "satellite-view/0025/0.png": "This is an aerial image of a traditional Chinese water town. In the center, a stone bridge crosses a wide, calm river, connecting two parts of the town. The river flows through green areas with trees and shrubs, bordered by narrow waterways. To the right, there are many dark-roofed buildings arranged in rows, some with courtyards and small gardens. The structures are close together, showing a dense layout. On the left, green spaces mix with more water channels and a few low buildings, including what appears to be a temple or old hall. The scene is quiet and orderly, with straight roads and pathways laid out neatly. The sky is clear, and sunlight casts soft shadows, giving the image a calm and peaceful feel. The overall atmosphere is serene, reflecting the harmony between nature and architecture."
    },
    {
        "satellite-view/0026/0.png": "This is an aerial image of a rural landscape featuring a small bridge over a narrow water channel. The bridge connects two pieces of land surrounded by green fields and patches of dense trees. To the left, there is a patterned field with rows of crops or shrubs, while to the right, a large, still body of water is bordered by a line of trees. In the bottom right corner, a paved road runs alongside the water. The greenery is vibrant, indicating a healthy natural environment, and the sky appears clear, suggesting a calm and bright day. The overall scene feels peaceful and undisturbed, with a balanced mix of natural and man-made elements."
    },
    {
        "satellite-view/0027/0.png": "This is an aerial image of a formal park with a symmetrical layout. At the center, there is a circular plaza with a geometric pattern of steps leading to a small green area. Surrounding the plaza are curved pathways lined with dense green trees, forming a natural border. To the left and right, straight tree-lined avenues extend into the distance, flanked by open green spaces and a small lake on the lower left. In the upper center, a rectangular reflecting pool with a fountain stands below a tall grove of trees. The scene is orderly and calm, captured under clear, bright daylight. The vibrant greenery and clean geometry suggest a peaceful urban green space."
    },
    {
        "satellite-view/0028/0.png": "This is an aerial image of a symmetrical campus or park area with a circular design at its center. The main feature is a large round plaza with a dark water fountain in the middle, surrounded by a light-colored walkway and intersected by four paved pathways leading outward. The area is divided into green lawn sections, some shaped like quadrants, and the greenery is neatly trimmed. Surrounding the central plaza are buildings with orange roofs and light-colored walls on the left and right sides, which appear to be part of an academic or institutional complex. Between the buildings and the central space, rows of trees and small shrubs line the paths. The sky is clear and bright, suggesting a sunny day with even lighting. The overall image feels orderly and calm, emphasizing balance and structure. The scene appears quiet and well-maintained, with no visible people or movement."
    },
    {
        "satellite-view/0029/0.png": "This is an aerial image of a park area with a unique circular structure at its center, surrounded by green trees and a shallow waterway. The central object is a large, amphitheater-like building with tiered seating, looking like a modern arena or performance venue. To the left, a red running track and a green sports field form a rectangular layout, flanked by sidewalks. On the right, a row of traditional buildings with sloped roofs sits near the water. The area is dotted with small trees and clear pathways, creating a peaceful and organized layout. The weather appears clear and calm, with sunlight evenly illuminating the scene, giving the foliage a vibrant green hue. Overall, the space feels balanced and well maintained, combining nature and architecture in a quiet harmony."
    },
    {
        "satellite-view/0030/0.png": "This is an aerial image of an urban area with a mix of buildings and green spaces. At the center is a large rectangular building with a light gray roof, surrounded by pathways and small areas of trees and grass. To the left, there is a complex of sports courts, each with a green surface and red borders, bordered by a dense row of trees. A canal runs along the bottom edge, with a small building nearby featuring a reddish-brown roof. On the right, more buildings and streets are visible, including a parking lot and some smaller structures. The area appears well-planned and clean, with greenery providing a calming contrast to the concrete and pavement. The weather is clear, with no signs of rain or fog, allowing for a sharp and detailed view of the scene."
    },
    {
        "satellite-view/0031/0.png": "This is an aerial image of a traditional complex surrounded by water and greenery. The central object is a courtyard with several dark-roofed buildings arranged symmetrically around a paved area with small trees. A pair of long, low structures extend from the main buildings, leading toward a covered bridge that spans the water. On the left, a field of light brown earth is bordered by a narrow waterway, while on the right, lush green trees line the canal. The water appears calm, reflecting the overcast sky, which casts a soft, even light across the scene. The area feels peaceful and well-preserved, like a quiet cultural site tucked away from modern life. No people or vehicles are visible, emphasizing solitude and stillness."
    },
    {
        "satellite-view/0032/0.png": "This is an aerial image of a waterfront area with green trees and buildings. In the center, a curved structure with white roofs sits beside a body of water, possibly a lake or bay. To the left, there is a green park next to the water, with a narrow path along the edge. To the right, a paved area with parking spaces and trees is visible. A road runs along the top edge, with more houses nearby. The scene is calm and orderly, surrounded by lush greenery and water. The weather appears clear, with no clouds or fog, giving the image a bright and open feel. The layout shows a mix of natural and developed spaces, creating a peaceful urban landscape."
    },
    {
        "satellite-view/0033/0.png": "This is an aerial image of a landscaped park centered around a large body of water and a circular garden structure. The main feature is a ring-shaped pond or lake on the left, with a small circular feature in the middle, possibly a fountain or island. In the center of the image is a concentric garden design, with green pathways forming a spiral pattern around a central stone area, likely a monument or sculpture. This garden is surrounded by patches of trees and greenery, with brown grassy spaces in between. To the right, a paved walkway and parking area with cars are visible. The scene is captured in clear daylight, with flat lighting and no visible shadows. The overall impression is one of organized natural beauty, calm and orderly."
    },
    {
        "satellite-view/0034/0.png": "This is an aerial image of a small island surrounded by water. In the center of the island is a round plaza with a large circular area, possibly a park or plaza, surrounded by trees and paths. A building with a flat roof and what appears to be a green roof sits near the top of the island. Winding paths connect different parts of the island, including a small bridge that links it to a nearby landform. To the left, a separate, smaller land area has another circular feature, possibly a gazebo, with a few trees and a path. The water surrounding the island is dark and still, reflecting the overcast sky. The overall scene is calm and quiet, suggesting a peaceful and secluded spot."
    },
    {
        "satellite-view/0035/0.png": "This is an aerial image of a modern waterfront development. In the center, a circular structure with a green dome stands on a stone platform surrounded by calm water. A curved stone walkway extends from the left, connecting to the main structure. To the right, several wooden piers jut into the water, some with small boats docked. The area along the edges features paved streets, green trees, and buildings, suggesting a mix of recreational and residential use. The water appears still and dark green, reflecting a neutral sky. The overall scene is clean and organized, with a quiet and orderly atmosphere. The lighting is soft and even, indicating an overcast day."
    },
    {
        "satellite-view/0036/0.png": "This is an aerial image of a modern building complex surrounded by green spaces and a winding waterway. The central structure features a large, angular design with a flat roof and solar panels, suggesting it is a public or cultural facility. To the right, there is a curved, white-roofed building, possibly an auditorium or exhibition hall. On the left, traditional-style houses with sloped roofs are visible along the banks of the water. A road runs along the bottom, with parked cars and trees lining the street. The area is lush with trees and shrubs, creating a peaceful contrast between nature and urban design. The sky is clear, casting bright, even light over the scene, which enhances the calm and well-organized feel of the space."
    },
    {
        "satellite-view/0037/0.png": "This is an aerial image of a city area with a mix of green spaces, buildings, and roads. In the center, there is a circular plaza with a large open space, surrounded by curved streets and green trees. Several buildings, mostly low-rise with flat or sloped roofs, are located around the plaza. To the left, there is a cluster of red-roofed houses and narrow streets, while on the right, a large white building stands near the edge. A wide road curves through the top of the image, with cars visible. The green areas include small parks and trees, creating a contrast with the built environment. The photo is clear, taken in bright daylight with no clouds. The overall scene looks calm and organized, showing a structured urban layout."
    },
    {
        "satellite-view/0038/0.png": "This is an aerial image of a city district with a mix of residential and green spaces. At the center, a large rectangular park with a geometric design is visible, featuring a central garden area surrounded by pathways and green lawns. To the left, there is a quiet street lined with trees and houses, leading toward a residential neighborhood with brick buildings. On the right, a dense cluster of orange-roofed buildings surrounds a smaller green courtyard, possibly a school or institutional complex. The overall atmosphere is calm and orderly, with a balanced layout of buildings, roads, and vegetation. The image appears clear, under bright, even daylight with no clouds or shadows, giving a clean and structured view of the area."
    },
    {
        "satellite-view/0039/0.png": "This is an aerial image of a park with a large curved pond and landscaped areas. In the center, a dark green pond is bordered by a red walkway and green trees. On the right, a circular pavilion with a dome sits near the water’s edge, while a smaller round structure appears on the left side of the pond. The park includes open grassy sections, shaded paths, and several small fountains or plazas. To the left, a busy street with cars runs parallel to the park. The scene appears clear with no signs of rain or fog, suggesting fair weather. The overall layout is well-maintained and peaceful, with a mix of natural and architectural elements."
    },
    {
        "satellite-view/0040/0.png": "This is an aerial image of a modern, wing-shaped architectural structure located in a landscaped urban area. The building, with its sweeping curved roofs and glass panels, stands at the center, resembling open wings or a blooming flower. Around it, green parks and trees provide a natural contrast to the hard surfaces of roads and pathways. To the left, a body of water borders the site, while to the right, a paved road runs alongside a sports field, visible by its green turf and white markings. Residential complexes with flat roofs are seen at the top, nestled among trees. The scene appears clear under bright, even daylight, suggesting a calm, orderly day with no visible people or traffic. Overall, the area feels clean and organized, reflecting a blend of nature and contemporary design."
    },
    {
        "satellite-view/0041/0.png": "This is an aerial image of a large, circular building surrounded by urban infrastructure. The central structure has a unique curved design with a dark roof and glass sections, featuring a prominent oval opening in the middle. To the right, there is a rectangular complex with flat rooftops, multiple smaller buildings, and a circular feature in the center, possibly a fountain. On the left, a parking lot and a tree-lined area are visible, while the bottom shows a curved road with many parked cars and green trees. The top edge reveals railway tracks and a busy street. The scene is captured under clear, bright sunlight, giving the image a sharp and flat appearance. The overall impression is that of a clean, structured urban environment."
    },
    {
        "satellite-view/0042/0.png": "This is an aerial image of a park area with a central sports complex. In the middle, there is a rectangular structure with a green tennis court and a red track, surrounded by white walls. To the left, lakes and green trees form a natural border. On the right, a long parking lot with many cars sits near a busy street with multiple lanes of traffic. Above the complex, a circular building with a dome is visible among more trees. The park is filled with greenery, and the scene is calm and orderly under clear skies with bright light, giving a peaceful and well-organized atmosphere."
    },
    {
        "satellite-view/0043/0.png": "This is an aerial image of a large urban complex with modern architecture and green spaces. In the center, a long white structure with a curved roof extends across the scene, possibly a bridge or covered walkway, connecting different areas. To the left, several rectangular buildings with flat roofs are arranged in a grid, some appearing to be made of glass and steel. To the right, a round green dome stands out, surrounded by trees and pathways. Below, a calm body of water reflects the surrounding greenery, and a park with lush trees lies between the buildings and the water. The scene is lit by clear daylight, with sharp shadows indicating a sunny day. The overall atmosphere is orderly and spacious, blending urban design with natural elements."
    },
    {
        "satellite-view/0044/0.png": "This is an aerial image of a park-like area centered around a circular building with a red roof and blue sections, likely a community center or gym. To the left, a wide canal runs vertically through the scene, crossed by a simple bridge with a small building on it. Lush green trees line both sides of the canal and fill most of the space around the central structure, creating a natural and serene setting. The area appears clean and well-maintained, with paved paths and small plazas visible. The weather is clear and bright, with no signs of rain or fog, suggesting a calm day. The overall atmosphere is peaceful, blending urban infrastructure with abundant greenery in a balanced way."
    },
    {
        "satellite-view/0045/0.png": "This is an aerial image of a large commercial complex with a prominent dome-shaped structure at its center. The main building has a dark roof with several smaller sections and two red domes on the sides. To the left of the building, there is a wide parking lot filled with cars. Around the complex, there are multiple parking areas with rows of parked vehicles and some green spaces with trees. Along the bottom edge of the image, a road runs horizontally with lush green trees on both sides. The lighting is even, suggesting a clear day with no visible clouds or shadows, giving the scene a neutral and organized appearance."
    },
    {
        "satellite-view/0046/0.png": "This is an aerial image of a city block featuring a large, modern building surrounded by green spaces. The central structure has a flat roof and multiple levels, with a mix of glass and dark surfaces. Around it, a paved area with trees forms a park-like zone, creating a contrast with the urban environment. To the left and right, smaller buildings, some with white roofs, line a network of roads. A wide road runs horizontally through the lower part of the image, with cars likely moving along it. The scene appears clear and evenly lit, suggesting a bright day with no clouds. The trees are full and lush, adding natural color to the otherwise gray and brown tones of the cityscape. The overall impression is one of calm organization, with nature integrated into the built environment."
    },
    {
        "satellite-view/0047/0.png": "This is an aerial image of a large, symmetrical architectural complex surrounded by green spaces. At the center is a circular plaza with concentric patterns and a central fountain, surrounded by a wide path. Radiating from the plaza are arched corridors and buildings with flat roofs, connected by walkways. To the left, a wide road runs parallel to the complex, with vehicles moving along it. The buildings are dark-toned, contrasting with the bright green trees and grass that fill the landscape. The scene is well-lit, suggesting a clear day with no visible clouds or shadows. The overall impression is one of order and balance, with the layout emphasizing structure and symmetry. The greenery adds a natural, calm feel to the urban space."
    },
    {
        "satellite-view/0048/0.png": "This is an aerial image of a large park with a central plaza. The center has a circular design with a fountain or round feature, surrounded by pathways and green areas. To the left and right, there are symmetrical sections of trees and small ponds, creating a balanced look. Above the plaza, a modern building with a glass roof sits near the edge of the park, connected by roads. The area has many trees, walkways, and landscaped sections, showing care in the layout. The sky is clear and the lighting suggests a bright day, making the greenery and paved areas stand out. The park looks peaceful and well-organized, with a formal, open atmosphere."
    },
    {
        "satellite-view/0049/0.png": "This is an aerial image of a green urban park with a large body of calm water. In the center, a curved bridge with small supports spans across the water, connecting two areas of land. The left side of the image shows a broad river or lake with a straight bank. On the right, the park includes landscaped gardens with trees, pathways, and several low-rise buildings, possibly pavilions or rest areas. A road with vehicles runs along the far right edge, near the buildings. Overhead, shadows from tall structures fall across the scene, suggesting the sun is high in the sky. The overall atmosphere is peaceful and structured, with natural and man-made elements blending together in a clean, well-maintained setting. The weather appears clear and bright."
    },
    {
        "satellite-view/0050/0.png": "This is an aerial image of a park with a large body of water and greenery. In the center, a long, curving road runs through the park, leading toward a large building on the right side. The building has a dark roof and is surrounded by paved areas and trees. To the left, the water is calm and reflects the green surroundings, with small, tree-covered islands in the middle. A few pathways and bridges connect different parts of the park. The area is filled with lush, dense trees that make the scene feel peaceful and natural. The sky is overcast, giving the image a soft, even light with no strong shadows. Overall, the setting appears quiet and well-maintained, blending nature and architecture harmoniously."
    },
    {
        "satellite-view/0051/0.png": "This is an aerial image of a residential neighborhood next to a curved lake. In the center, the lake reflects the sky, with a small white structure on its edge. To the left, rows of houses with brown roofs are arranged in a pattern, surrounded by green trees and bushes. The area looks well-planned and peaceful, with clean pathways and consistent landscaping. On the right, a tall structure with a grid pattern, likely a bridge or overpass, runs parallel to the lake’s edge, hinting at nearby urban activity. The weather is clear, with bright light illuminating the scene. The overall feeling is calm and organized, reflecting a quiet, structured community environment."
    },
    {
        "satellite-view/0052/0.png": "This is an aerial image of a large, symmetrical building complex surrounded by greenery and a body of water. The central structure is a long, multi-winged building with a traditional design, featuring a dark roof and light-colored walls, appearing calm and formal. To the left, there is a curved, modern-looking area with a dark roof and a small open space, possibly a plaza, lined with trees and streetlights. The right side includes more green space and a few smaller buildings. The area is bordered by a road with a few vehicles visible, suggesting some activity. In the foreground, a lake with calm water reflects the surrounding area. The weather appears clear and sunny, with bright light casting soft shadows, giving the scene a peaceful and well-organized feel."
    },
    {
        "satellite-view/0053/0.png": "This is an aerial image of a green park next to a large body of water. In the center, a curved stone walkway with steps leads down to a small, dark circular area, possibly a fountain or pond. To the left, the water is calm and dark green, while the right side shows a lush green lawn with scattered trees and a winding path. On the lower left, a small commercial area with buildings and parked vehicles is visible, suggesting a marina or dock. The scene is quiet and orderly, with even lighting indicating a clear day. The overall atmosphere feels peaceful and well-maintained, with the natural and built environments coexisting neatly."
    },
    {
        "satellite-view/0054/0.png": "This is an aerial image of a green park beside a calm lake. In the center, a modern circular building with a white roof sits near the water’s edge, surrounded by paved walkways and trees. To the left, a narrow river flows along a grassy bank with small structures and a bridge. On the right, a large pond with a curved path and dense shrubs is visible. The area features lush green grass and small patches of flowers, suggesting spring or summer. The water is still and reflects a soft gray tone, indicating an overcast day with no direct sunlight. The overall scene feels peaceful and quiet, with nature and man-made structures coexisting in balance."
    },
    {
        "satellite-view/0055/0.png": "This is an aerial image of a large park area surrounding a lake. In the center, a circular building with a flat roof sits beside a paved walkway that curves around the water. To the left, there are green lawns, a small square of dirt paths, and some trees. The lake is calm and dark green, reflecting the sky. The surrounding land is filled with trees and greenery, giving a peaceful and open feeling. The weather appears clear, with bright daylight and no clouds visible, enhancing the view of the natural landscape and the man-made structure. The scene is quiet and relaxed, with a mix of natural and urban elements."
    },
    {
        "satellite-view/0056/0.png": "This is an aerial image of a park-like area with several large white domed structures. In the center, two prominent white domes sit side by side, surrounded by curved walkways and a circular garden bed with green shrubs. To the right of the domes is a low-roofed building with dark windows, possibly a visitor center. A winding path runs from the upper left toward the domes, passing through grassy lawns and patches of trees. On the left, a rectangular concrete building sits near a narrow water channel, while a larger lake borders the top and right edges. The greenery is lush and well-maintained, and the view is clear under bright daylight, suggesting a calm and orderly outdoor space."
    },
    {
        "satellite-view/0057/0.png": "This is an aerial image of a modern building complex surrounded by green areas and a body of water. In the center, a large rectangular structure with a light-colored roof stands out, connected to a smaller building with a sloped roof. To the right, a geometric garden with paved paths and neatly arranged plant beds adds a formal touch. The left side features a long, low building with a flat roof, likely an exhibition or support space, bordered by trees and a winding path. A parking area with vehicles is visible at the bottom, and greenery covers most of the surrounding land. The scene appears calm and well-organized under clear daylight, with no signs of rain or fog. The overall atmosphere is peaceful and orderly, reflecting a designed natural and architectural harmony."
    },
    {
        "satellite-view/0058/0.png": "This is an aerial image of a modern urban campus. At the center, several white rectangular buildings are arranged neatly around green spaces, with a few small trees and pathways connecting them. To the lower left, a red and green sports field is visible, with a standard track surrounding a large green field. A curved river runs along the left edge of the frame, separating the campus from a multi-lane road. On the right side, larger structures, including a building with glass panels and curved roofs, stand out. The area appears calm and well-planned under clear daylight, with no visible people or vehicles, giving the scene a quiet and orderly atmosphere."
    },
    {
        "satellite-view/0059/0.png": "This is an aerial image of a large cultural or historical complex. In the center, a wide pathway leads toward a prominent building with a circular structure in the foreground. To the left, a series of traditional-style buildings with tiled roofs are arranged in a corridor-like layout, surrounded by green trees and small courtyards. To the right, a grander, symmetrical building features a central dome and an inner courtyard, suggesting a significant architectural role. Green vegetation and small pathways frame each area, creating a balanced and orderly design. The scene is captured under bright, clear skies, with no signs of fog or rain. The layout appears calm and organized, showcasing a deliberate blend of nature, architecture, and space, presenting a sense of quiet dignity and historical weight."
    },
    {
        "satellite-view/0060/0.png": "This is an aerial image of a peaceful residential area surrounded by water and greenery. In the center, a paved road winds through the neighborhood, connecting small houses with red-tiled roofs. To the right, a round pond sits in a grassy park area, while on the left, a stone bridge spans a narrow canal linking two green spaces. A large building complex with a curved layout is visible at the far left, surrounded by lush trees. The scene is bathed in soft light, suggesting a calm, overcast day. The overall atmosphere is tranquil and orderly, with the mix of water, trees, and architecture creating a quiet urban retreat."
    },
    {
        "satellite-view/0061/0.png": "This is an aerial image of a rectangular building surrounded by greenery and water. The building has a light-colored roof and is positioned centrally, with a large pond to its upper left and a long, narrow river to its right. On the left side, a circular garden with a central feature is visible, connected to the building by a pathway. Trees and grass cover most of the surrounding area, giving the scene a calm and organized feel. A road runs along the bottom edge of the image, with a few vehicles visible. The weather appears clear and bright, with no signs of clouds or rain. The overall atmosphere is peaceful and structured, with a harmonious balance between nature and architecture."
    },
    {
        "satellite-view/0062/0.png": "This is an aerial image of a large park area with a mix of natural and architectural features. In the center, a complex of traditional-style buildings with green roofs is surrounded by trees and manicured lawns. To the left, a green sports field, possibly a soccer pitch, is visible. On the right side, a modern rectangular structure with a flat roof stands near the water’s edge. A river flows along the upper boundary, bordered by trees and a park path. The scene is calm and organized, with a clear division between open green spaces and built structures. The lighting suggests a bright, clear day with no signs of rain or fog, creating a clean and calm atmosphere."
    },
    {
        "satellite-view/0063/0.png": "This is an aerial image of a park area near a lake. In the center, there is a small building with a rounded roof surrounded by green trees and pathways. A curved walkway leads from the center to the lake, which is on the left side of the image. The lake has a calm surface, and there is a sandy beach along its edge. To the right of the main area, more green spaces and some open fields are visible. The scene appears peaceful and well-kept, with trees showing bright green leaves. The weather is clear, and the ground is dry, suggesting a sunny day. There are no people visible, which adds to the quiet and organized layout of the space."
    },
    {
        "satellite-view/0064/0.png": "This is an aerial image of a large amusement park and surrounding area. In the center, there is a circular plaza with a patterned design, possibly a fountain or centerpiece, surrounded by pathways. To the right of the plaza, several buildings are visible, including one with a large white tent-like roof. Adjacent to the buildings is a section with colorful water rides, including slides and pools. On the left side, a road runs vertically, separating the park from a parking lot and some green spaces. Trees and bushes are scattered throughout the area, adding greenery. The weather appears clear, with bright sunlight casting short shadows. The overall feel is organized and lively, suggesting a well-maintained recreational space."
    },
    {
        "satellite-view/0065/0.png": "This is an aerial image of a water park with many attractions. In the center, there is a large white building with a circular roof, surrounded by green trees. To the left, a long pool with white covers is visible, along with several white roofed buildings. A dark river runs through the middle, separating the central area from the bottom section, which has a round white structure with petal-like roofs. To the right, there are colorful water slides and a large blue pool area with circular patterns. The entire scene appears peaceful and well-organized under bright sunlight. The park has a clean and structured look, with greenery making it feel fresh and inviting."
    },
    {
        "satellite-view/0066/0.png": "This is an aerial image of a grand palace complex surrounded by formal gardens and water features. At the center stands a large, symmetrical building with dark roofs and light-colored walls, flanked by smaller structures on either side. A wide, paved courtyard stretches from the main building, divided into geometric sections with green lawns and trimmed hedges. A canal or moat runs beneath a stone bridge in the foreground, connecting to a larger body of water. To the left, a curved road passes through trees, while on the right, more trees and pathways are visible. The scene is clear and bright, with no visible weather effects, suggesting a sunny day. The atmosphere is calm and orderly, reflecting the uniform design and clean layout of the estate."
    },
    {
        "satellite-view/0067/0.png": "This is an aerial image of a residential neighborhood with a central park. In the center, there is a green park area with a circular road and a statue or monument at its middle, surrounded by trees and a few buildings, including a brown-roofed structure. The park is bordered by rows of houses with red-brown roofs, arranged in neat patterns, with green trees and foliage filling the spaces between them. The roads form a grid-like pattern, connecting the homes. On the left and right, more homes extend outward, creating a balanced, orderly layout. The image is clear and bright, suggesting a sunny day with no clouds, making the greenery look vibrant. The overall feel is calm and well-organized, like a peaceful suburban area."
    },
    {
        "satellite-view/0068/0.png": "This is an aerial image of a residential neighborhood. The central part of the image shows a grid of houses with red roofs, surrounded by green trees and bushes. To the left, there is a winding road with a few visible cars. On the right, a larger open area with a circular structure stands out, likely a public space or small park. The houses are closely packed, each with its own small yard. A canal or waterway runs along the bottom edge, with a bridge crossing it. The weather appears clear and bright, suggesting a sunny day. Overall, the neighborhood looks orderly and calm, with a natural mix of built and green spaces."
    },
    {
        "satellite-view/0069/0.png": "This is an aerial image of a residential area with a large pond at its center. The pond is surrounded by green trees and several houses with dark roofs. On the left side, there is a road with cars and a few parked vehicles. A small building with a blue roof sits near the pond, possibly a daycare or pavilion. To the right, more houses with greenery around them extend toward another road. The buildings are arranged in a mix of clusters and rows, with patches of open space and land that look partially developed. The weather appears clear, with bright and even lighting across the scene. The still water reflects the surrounding greenery, giving the area a peaceful and natural feel. Overall, the image shows a quiet, green neighborhood blending nature and housing."
    },
    {
        "satellite-view/0070/0.png": "This is an aerial image of a modern highway intersection with a large roundabout at the center. The roundabout is surrounded by multiple lanes of roads and connecting ramps, forming a complex network of traffic flow. On the left, there are several parallel roads with vehicles moving in orderly rows. To the right, a long elevated road stretches across the frame, with some greenery and trees along its edge. A body of water appears on the top part of the image, reflecting a light green tone, while the bottom section shows open land and a small circular structure that looks like a park feature. The overall scene is clear and bright, indicating a sunny day with no clouds. The atmosphere feels organized and calm, typical of a well-planned urban infrastructure layout."
    },
    {
        "satellite-view/0071/0.png": "This is an aerial image of a campus or institutional complex. In the center, several large buildings with flat roofs are grouped together, surrounded by trees and pathways. To the bottom left, there is a sports field with a red running track and green playing area, indicating recreational space. On the left side of the image, a canal runs parallel to a multi-lane road with steady traffic, bordered by greenery. On the right, more buildings are visible, including a circular structure and others with white roofs. The area appears well-planned and spacious, with open green spaces and organized layouts. The weather is clear, with bright daylight illuminating the scene and casting soft shadows, giving the view a calm and orderly feel."
    },
    {
        "satellite-view/0072/0.png": "This is an aerial image of a green park area surrounded by buildings and a river. In the center, there is a circular structure, possibly a pavilion or fountain, near a cross-shaped grassy space. To the right, a small pond is surrounded by lush trees. A reddish structure, possibly a gazebo or shed, sits on the edge of the water. To the left, white-roofed buildings and a parking lot with a few cars line a road. The vegetation is dense and vibrant, indicating spring or summer. The atmosphere is calm and peaceful, with the natural elements offering a quiet contrast to the nearby built environment. The weather appears clear, with no signs of fog or rain, allowing a sharp view of the scene."
    },
    {
        "satellite-view/0073/0.png": "This is an aerial image of a park featuring a large, modern structure at its center. The building has a rounded, white dome with a transparent, bulb-shaped section, surrounded by a paved plaza. A dark, kidney-shaped lake encircles the structure, while green trees form a dense, lush border around the entire area. To the left, a multi-lane road with steady traffic runs parallel to the park. On the right, a narrow waterway flows alongside the green space. The scene is viewed from above on a clear day with bright sunlight, casting soft shadows. The atmosphere feels calm and organized, blending natural and architectural elements in a quiet, structured layout."
    },
    {
        "satellite-view/0074/0.png": "This is an aerial image of a green space near a waterway, surrounded by roads and buildings. In the center, there is a large white structure with a sloped roof, possibly a pavilion or tent, set within a grassy area. To the left, a multi-lane highway runs parallel to the scene, while dense trees border both sides of the space. On the right, a calm river flows alongside the green area, interrupted by a series of small boats or docks. Buildings with dark roofs are located in the upper middle section, partially hidden by trees. The surface of the water is still and reflects the sky faintly. The overall view is clear and evenly lit, suggesting a bright, sunny day with no visible clouds. The scene feels peaceful and well-maintained."
    },
    {
        "satellite-view/0075/0.png": "This is an aerial image of a suburban area with a mix of residential and industrial buildings. In the center, a straight road runs vertically, divided by a median and flanked by trees, leading toward a roundabout with some parked cars. To the left, a large industrial complex with several large white-roofed buildings is surrounded by greenery and small ponds. The right side features a dense neighborhood of single-family homes with dark roofs, nestled among thick trees. Smaller streets branch off from the main road, creating a grid-like pattern. The scene is captured on a clear day with bright light and no visible shadows, giving it a sharp and clean appearance. The overall atmosphere is calm and orderly, with a quiet charm."
    },
    {
        "satellite-view/0076/0.png": "This is an aerial image of a large campus with a symmetrical layout. At the center is a wide open plaza surrounded by buildings with gray roofs and green trees. The buildings are arranged in a U-shape, forming a courtyard. To the left, there is a parking area with many cars and a curved road lined with green trees. On the right side of the image, there is a red sports field with a green football pitch and several smaller courts. In the lower part of the image, there are rows of houses with red and brown roofs. The scene is captured under clear daylight with no clouds, giving the image a bright and calm appearance. The overall layout appears peaceful and well-organized."
    },
    {
        "satellite-view/0077/0.png": "This is an aerial image of a scenic park area featuring a large pond surrounded by lush green trees and pathways. In the center, the pond has a small island with a white object, possibly a sculpture. To the lower left, several buildings with dark roofs are arranged in a complex, possibly a cultural or recreational center. A road curves around the pond, connecting the structures. On the right, a waterway runs parallel to the main path, leading toward more greenery and additional buildings. The area appears peaceful, with no visible people or vehicles. The sky is clear, and sunlight evenly lights the scene, highlighting the rich greens and earth tones. The overall impression is that of a tranquil and well-maintained natural space."
    },
    {
        "satellite-view/0078/0.png": "This is an aerial image of a small landmass surrounded by calm, greenish water. A narrow bridge stretches from the land to a tiny, round island on the left, connecting them. The land itself is irregularly shaped and covered with patches of green trees and open dirt. Winding paths cut through the greenery, leading to a large building complex on the right, which appears to be under construction, with visible scaffolding and scattered materials. To the far left, a small, grassy island floats separately in the water. The scene is viewed from a high angle on a clear day, with bright sunlight reflecting off the water, creating a still and peaceful atmosphere."
    },
    {
        "satellite-view/0079/0.png": "This is an aerial image of a modern park featuring a curved, grassy area with a central open space, bordered by a low wall and a path. To the left, a calm, greenish-blue body of water flows alongside the park, with a small bridge crossing it. The right side contains a wide, striped paved area, likely for parking or events, surrounded by scattered trees. The scene appears clean and orderly, with natural and man-made elements arranged symmetrically, creating a balanced and tranquil environment under a clear sky. The overall impression is calm and organized, ideal for relaxation and leisure."
    },
    {
        "satellite-view/0080/0.png": "This is an aerial image of a man-made lake with a small island in the center. The island has a white, rectangular building surrounded by trees and greenery. A curved path runs along the right side of the lake, connecting to a paved area with benches and landscaping. To the left, the lake stretches out, its water a calm green-blue. Above the scene, a bridge with multiple lanes crosses the background, carrying vehicles. The overall view is peaceful and organized, with clear, bright lighting indicating a sunny day. The atmosphere is quiet and structured, suggesting a well-maintained urban park."
    },
    {
        "satellite-view/0081/0.png": "This is an aerial image of a small lakeside area with a mix of natural and man-made features. On the left, a large body of calm green water surrounds a narrow peninsula with a concrete structure at its tip, possibly a small dock or viewing platform. A curved road runs along the right side of the image, bordered by patches of green grass and a few trees. In the center, a series of paths and a small pavilion connect the peninsula to the mainland. To the right, a rectangular, sandy-colored plot is enclosed by a low fence, perhaps a sports field or construction site. The overall scene feels calm and quiet, with clear visibility and bright daylight illuminating the landscape. The area appears well-maintained but not crowded, offering a peaceful setting."
    },
    {
        "satellite-view/0082/0.png": "This is an aerial image of a road intersection surrounded by open land. In the center, a multi-lane road crosses another highway, forming a traffic junction with a small roundabout. To the left, flat fields with rows of crops are visible, bordered by a straight road with a red vehicle and a white car. On the right, a patch of sparse trees and dry grass covers uneven ground, with a curved path leading to a small building. The surrounding areas include a mix of green, brown, and gray surfaces, suggesting a blend of natural and developed land. The scene is clear and well-lit, indicating a sunny day with no clouds, giving the image a calm and orderly appearance."
    },
    {
        "satellite-view/0083/0.png": "This is an aerial image of a symmetrical campus or institutional complex. At the center is a large rectangular lawn with a geometric pattern of dirt paths forming a star shape, leading to a circular feature in the middle. The lawn is surrounded by several large buildings with uniform designs, featuring flat roofs and white or light-colored facades. On the left and right sides of the image, there are open spaces with trees arranged in rows and dirt pathways forming cross-shaped patterns. A dark, straight road runs along the lower edge of the image. The sky appears clear and the lighting suggests a bright day, casting soft shadows. The overall atmosphere is orderly and calm, with a sense of balance and structure."
    },
    {
        "satellite-view/0084/0.png": "This is an aerial image of a lake with a small, tree-covered island at its center. The island has three distinct green areas, forming a triangular pattern around a grassy, oval-shaped lawn. To the upper left of the island, a wooden dock extends into the water, with several boats tied alongside. The lake’s dark water contrasts with the surrounding land, which is a mix of dirt paths, patches of grass, and clusters of trees. On the left side, a curved path follows the shoreline, while on the right, more vegetation and a flat stretch of land are visible. The image appears to be taken on a clear day, with bright, even light and no signs of rain or fog. The scene feels calm and still, with no visible activity, giving it a peaceful, quiet atmosphere. The colors are natural, with green, brown, and dark blue tones dominating."
    },
    {
        "satellite-view/0085/0.png": "This is an aerial image of a park-like area beside a highway. In the center, there is a long, narrow waterway running horizontally, flanked by green grass and small trees. To the left, there is a parking lot with a few cars and a row of small buildings. A pathway runs along the edge of the water on the right, leading to a circular green space with a central path. In the background, near the top of the image, a train track runs parallel to the road, with a series of solar panels mounted nearby. The scene is bright and clear, suggesting a sunny day. The overall atmosphere is calm and orderly, with a mix of natural and man-made elements."
    },
    {
        "satellite-view/0086/0.png": "This is an aerial image of a landscaped park with a large body of water and several small islands. In the center, a unique-shaped island covered in green grass and trees sits within the dark water, connected to the mainland by a narrow path. To the left, another island with trees and a curved walkway can be seen, while on the right, more land areas are visible with dirt paths and scattered buildings. A paved road runs along the bottom of the image, with a few vehicles visible. The scene appears calm and well-planned, with natural shapes contrasting with structured layouts. The weather is clear, with no clouds or haze, allowing for sharp details and rich colors across the greenery, water, and earth tones."
    },
    {
        "satellite-view/0087/0.png": "This is an aerial image of a park with decorative landscaping and a large pond. In the center, there is a circular garden with a green patch in the middle, surrounded by curved paths and patterns made from different plants. To the left, another design features concentric rings with geometric shapes. On the right, a dark body of water stretches into the frame, with a path and some structures near the shore. A river runs along the top edge of the image. The surroundings include patches of green grass and trees. The image appears to be taken on a clear day with bright light. The overall scene looks calm and open, with the designs giving a sense of careful planning. The colors are mostly earthy browns and greens, with the dark water providing contrast."
    },
    {
        "satellite-view/0088/0.png": "This is an aerial image of a park under construction, viewed from above on a clear day. The central area contains a play space with colorful circular structures, some green and others pink and blue, arranged around a sandy ground. Rocks and curving pathways surround the play area, leading to different sections of the park. To the right, a calm, dark green pond is bordered by a paved walkway and a small white building near its edge, possibly a boathouse. Along the left side of the image, a wide dirt path curves through the scene, intersected by a smaller green-dotted walkway. The surrounding ground is mostly bare earth, with sparse grass, indicating ongoing development. The entire scene feels open and orderly, suggesting a planned transformation into a leisure space. The daylight provides good visibility, casting soft shadows that highlight the terrain’s texture."
    },
    {
        "satellite-view/0089/0.png": "This is an aerial image of a modern water management facility, possibly a flood control basin or reservoir. At the center is a large, curved, dark structure that appears to be a gate or floodwall, surrounded by layered concrete channels and green embankments. To the left, there is a wide paved area and a track-like path running alongside the green zones. On the right, the scene transitions into a more developed area with paved roads, parking lots, and buildings, including what appears to be a small industrial or utility structure. A narrow water channel snakes alongside the facility, connecting it to a larger water body. The image shows clear daylight with no clouds, and the vibrant green grass contrasts with the gray concrete and dark structures. The overall impression is one of organized functionality, with a clean and orderly environment."
    },
    {
        "satellite-view/0090/0.png": "This is an aerial image of a landscaped area beside a large body of water and a highway. In the center, there are several buildings with dark roofs surrounded by green trees and a paved courtyard. To the left, a multi-lane highway runs parallel to the scene, with cars visible on the road. A tennis court with red and green markings sits between the buildings and the highway. On the right, the calm water shows patches of green algae. The surrounding area includes grass and some dense trees, with a curved road looping around the buildings. The weather appears clear and bright, with good visibility and no signs of rain or fog. The overall atmosphere feels peaceful and organized, with natural and man-made elements arranged in a quiet balance."
    },
    {
        "satellite-view/0091/0.png": "This is an aerial image of a large campus surrounded by green trees and roads. In the center, there are several long, modern buildings with flat roofs, arranged in a cross-like pattern, connected by covered walkways. To the left, a smaller structure with a sloped roof sits near a road with vehicles, while on the right, a circular garden with a central feature appears near a parking lot. The surrounding area features patches of greenery and paved paths, creating a balanced mix of nature and architecture. The sky is clear, and the sunlight casts soft shadows, giving the scene a calm and orderly appearance."
    },
    {
        "satellite-view/0092/0.png": "This is an aerial image of a modern urban complex, centered around a large rectangular building with a flat roof and visible structural lines. The building has a symmetrical design with two main sections connected by a central section, and is surrounded by green lawns and trees. To the left, a wide road runs vertically, with vehicles visible on the street and a pedestrian crossing nearby. To the right, there is a smaller structure with a slanted roof and adjacent parking spaces. A patterned walkway connects different sections of the area, forming a grid-like layout. The scene is captured in clear daylight, with no clouds in the sky, giving the image a bright and organized appearance. The presence of well-maintained landscaping and clean streets creates a sense of order and efficiency, typical of contemporary city planning."
    },
    {
        "satellite-view/0093/0.png": "This is an aerial image of a large urban area with a complex of buildings surrounded by green trees. In the center, there is a long rectangular structure with many windows and flat roofs, possibly a school or office complex. To the left, smaller buildings with dark rooftops are visible, while to the right, a curved road or pathway winds through the area. At the top, a wide road or highway runs horizontally, with a few vehicles moving along it. The trees form a dense green border between the buildings and the road, giving a sense of organized nature. The lighting suggests it is a clear day with bright sunlight, casting soft shadows. The atmosphere is calm and structured, showing a well-planned mix of urban development and green space."
    },
    {
        "satellite-view/0094/0.png": "This is an aerial image of a large building complex surrounded by greenery and a body of water. The central structure is a modern rectangular building with a flat roof and a courtyard in the middle, appearing well-organized and solid in design. To the left, smaller buildings with similar flat roofs are visible, arranged along a curved road lined with trees. On the right, a dark, still lake stretches outward, with a curving walkway and a circular garden feature near its edge. The area is rich in green trees and shrubs, giving it a peaceful and clean feel. The image is taken on a clear day with bright sunlight casting sharp shadows, highlighting the textures of the buildings and landscape. The overall atmosphere is calm and orderly, typical of a planned urban or institutional setting."
    },
    {
        "satellite-view/0095/0.png": "This is an aerial image of a modern campus with buildings arranged around green spaces and a waterway. In the center, a large, rectangular building with a flat roof stands out, surrounded by smaller structures. To the left, a long, low building stretches along the edge of a small pond, while to the right, a unique circular structure with a domed roof and orange-colored ceiling is visible. Tree-lined paths and patches of grass separate the buildings, creating a balanced layout. The scene is captured under clear weather, with bright light highlighting the shapes and colors of the architecture and landscape. The overall impression is orderly and composed, reflecting a functional and well-planned environment."
    },
    {
        "satellite-view/0096/0.png": "This is an aerial image of a sports and recreational area. In the center is a green soccer field surrounded by a red running track, with a small blue building at one end. To the right of the field are several tennis courts with white lines on green courts. Adjacent to the courts is a large, curved building with a white roof and a grid-like upper level. To the right of that is a round, green park area with a central feature, possibly a fountain or sculpture. The area is surrounded by dense green trees and a few buildings, including a long dark structure in the upper right. The scene is bright and clear, suggesting a sunny day with no clouds in the sky. The overall atmosphere is calm and well-organized."
    },
    {
        "satellite-view/0097/0.png": "This is an aerial image of a riverside neighborhood with a small bridge crossing the water. In the center, the bridge connects two sides of the river, with buildings lining both banks. On the left, there are residential houses with red-tiled roofs and green trees nearby, while on the right, structures appear more modern and dense, with wider roads. The river flows calmly between the areas, reflecting the overcast sky. The scene is quiet, with no visible people or vehicles, suggesting a peaceful day. The lighting is soft and even, indicating a cloudy or overcast day without direct sunlight."
    },
    {
        "satellite-view/0098/0.png": "This is an aerial image of a large institutional campus. At the center is a rectangular building complex with light-colored roofs and symmetrical wings. In front of the main structure is a small, grassy courtyard surrounded by paved walkways and trees. To the left is a green sports field with red markings and white lines. A curving canal runs through the middle of the scene, connecting to a round pond on the right. The area is rich with greenery, including rows of trees lining pathways. The surrounding roads and structures suggest a functional, well-planned environment. The scene is captured under clear lighting, indicating a sunny day with no visible clouds. The overall impression is of a calm and organized space, both functional and peaceful."
    },
    {
        "satellite-view/0099/0.png": "This is an aerial image of a modern campus or institutional complex. In the center, a long, wide pathway runs vertically, lined with small green trees and flanked by rectangular buildings. On the left, there is a dark pond surrounded by dense green trees and a circular structure with a white dome and small pool. To the right of the pathway, a cluster of buildings with flat roofs and solar panels sits beside more greenery. In the upper part of the image, additional buildings with light-colored roofs are visible, connected by roads and walkways. The area appears clean and well-organized, with a mix of open spaces and structured architecture. The weather seems clear with bright daylight, offering a sharp view of the layout. The image gives a calm and orderly impression, reflecting a balanced fusion of nature and urban design."
    },
    {
        "satellite-view/0100/0.png": "This is an aerial image of a mixed-use area featuring a sports field, greenery, and buildings. In the center-left, a red running track surrounds a grassy baseball or soccer field, bordered by trees. To the right, a modern building with a flat roof and large windows is surrounded by a well-kept park with winding paths and dense trees. A small stream flows through the green space. On the far left, a multi-lane highway runs vertically beside the scene. The area appears calm and orderly. The sky is overcast, with even, soft lighting and no shadows, giving the image a neutral tone."
    },
    {
        "satellite-view/0101/0.png": "This is an aerial image of a large industrial or commercial complex. The center of the image features multiple long, rectangular buildings with gray roofs arranged in a grid-like pattern, surrounded by paved roads and parking areas. In the top left, a road with gentle curves runs parallel to a green space with a patterned design. On the right side, a fenced area with what appears to be a sports court or sandbox is visible. The entire site is bordered by trees and shrubs, providing some greenery among the concrete and asphalt. The image is taken under clear skies with bright sunlight, casting soft shadows and giving the scene a calm, organized look."
    },
    {
        "satellite-view/0102/0.png": "This is an aerial image of a park with a mix of greenery and man-made structures. In the center, there is a circular area with light-colored steps or terraces, resembling a small amphitheater, surrounded by dense trees and bushes. To the top, a busy street runs horizontally, with a few cars and road markings visible, suggesting moderate traffic. On the right, a few buildings and what looks like a parking lot are seen beside the road. The left and bottom parts of the image show more trees and some residential or low-rise buildings. The scene appears to be under clear daylight, with no signs of rain or fog. Overall, the area feels calm and partly developed, where nature and infrastructure coexist in a quiet balance."
    },
    {
        "satellite-view/0103/0.png": "This is an aerial image of a riverside area with residential buildings and green spaces. In the center, a long, light-colored structure with a sloped roof sits along the riverbank, possibly a market or pavilion. To the left, a cluster of dark-roofed houses and trees forms a quiet residential zone. On the right, a narrow road runs parallel to the river, bordered by more greenery and scattered buildings. The river flows calmly, its light green water reflecting the overcast sky. The scene feels peaceful and organized, with clear contrasts between the built environment and natural elements. The weather appears cloudy and calm, creating soft lighting across the landscape."
    },
    {
        "satellite-view/0104/0.png": "This is an aerial image of a riverfront residential area. On the left, a wide river flows gently, bordered by a curved green park with a small circular structure near the water’s edge. Along the riverbank, trees are scattered, adding greenery to the scene. In the center and to the right, rows of traditional-style buildings with dark rooftops and light-colored walls form a compact neighborhood. A large courtyard in the lower center contains an open space with white structures, possibly for parking or small shops. To the far right, a modern building with a curved blue roof stands out among the older homes. A few roads connect the buildings, with vehicles visible on the streets. The image is clear and bright, likely taken on a sunny day with no clouds, giving the landscape a calm and orderly appearance."
    },
    {
        "satellite-view/0105/0.png": "This is an aerial image of a mixed urban area with residential, commercial, and green spaces. At the center is a roundabout surrounded by a circular park with green trees and curved pathways, one featuring a small central fountain. To the left, there is a dense block of low-rise housing with dark rooftops, partially shaded by tall trees. A busy street runs diagonally across the image, with several cars and visible traffic flow; intersections are marked by paved crossings. On the right, modern buildings with flat roofs and some colorful rooftops stand near the park. The area appears neatly organized, with a blend of nature and city life. The image is captured in bright daylight, with clear shadows suggesting a sunny day. The overall atmosphere is calm and orderly."
    },
    {
        "satellite-view/0106/0.png": "This is an aerial image of a campus-like area with buildings, a sports field, and green spaces. In the center, a large oval track surrounds a grassy field, with tennis courts visible to the right. Several rectangular buildings with flat roofs are arranged in rows, surrounded by trees and paved paths. To the left, a straight road with traffic runs parallel to the complex, and a bridge crosses a narrow waterway on the right side. The scene appears clear and calm, with bright sunlight casting soft shadows, indicating a sunny day. The layout is orderly, giving a sense of peace and functionality."
    },
    {
        "satellite-view/0107/0.png": "This is an aerial image of a modern cultural or educational complex surrounded by water and greenery. At the center is a large circular plaza with a sunken design, featuring concentric rings and benches around its edge. To the left of the plaza stands a long building with multiple sections, topped with flat roofs and covered in light-colored panels. This structure appears to be the main facility, possibly a museum or library, with a large open space visible inside. On the right side, a smaller building with a curved roof sits near the water’s edge, and a flat-roofed industrial-style building is visible in the top right corner. The area is connected by narrow bridges and pathways, creating a mix of open spaces and green landscaping. The scene is calm and orderly under bright, clear daylight."
    },
    {
        "satellite-view/0108/0.png": "This is an aerial image of a modern stadium and its surrounding area. The central object is a large stadium with a white curved roof and a green field surrounded by a red running track. To the left, there are several red-roofed buildings arranged in a grid, with parking spaces and roads nearby. The roads curve around the stadium and have a few cars. Green patches of trees and grass are spread across the area. The image is taken under overcast skies, giving a soft and even lighting. The overall atmosphere is calm and organized, showing a well-planned urban space."
    },
    {
        "satellite-view/0109/0.png": "This is an aerial image of a large building complex surrounded by green trees and roads. The central structure has a modern, geometric design with a square layout and a flat roof, featuring a smaller building at the center with a covered walkway. To the left, there is a parking area and a smaller building with a sloped roof. Below the main structure, a secondary building with curved edges and a lighter-colored facade is visible. Trees and paved paths connect the buildings, and roads run along the sides with a few vehicles. The scene is clear and bright, suggesting a sunny day with no clouds. The overall atmosphere is calm and orderly, showing a well-planned urban space."
    },
    {
        "satellite-view/0110/0.png": "This is an aerial image of a wide river crossing with a long, elevated road bridge. The bridge stretches horizontally across the frame, connecting two land areas separated by the water. On the left side, there are rows of residential buildings with green trees around them. On the right, a large green park with many trees and walking paths is visible, along with some buildings near the water. The river appears calm and dark, reflecting little light. The image is clear and well-lit, suggesting a bright day with good visibility. The overall view is orderly and structured, showing a blend of urban and natural environments. The scene feels peaceful and organized, with no visible people or vehicles on the bridge."
    },
    {
        "satellite-view/0111/0.png": "This is an aerial image of a mixed-use urban area with a canal running through the center. On the left, there is a large white-roofed building with a green field beside it, possibly a sports complex. To the right, a series of low-rise buildings with flat roofs are arranged around a parking lot with several cars. The canal, dark and calm, flows horizontally across the frame, flanked by green trees and a small bridge connecting both sides. The area appears organized and quiet, with no visible people or movement. Sunlight is bright, casting clear shadows, indicating a clear day. The overall impression is neat and orderly, with a balance between green spaces and urban development."
    },
    {
        "satellite-view/0112/0.png": "This is an aerial image of a modern urban area featuring a large round building with a curved roof, likely a sports stadium or dome. The central part shows a circular green field surrounded by a red walking path, with a decorative golden sculpture at its center. To the left, there are multiple tennis courts with green and red surfaces, bordered by structured landscaping and small buildings. A paved road intersection with clear traffic markings runs through the scene, connecting different areas. On the right, parking lots with white lines and scattered trees are visible. Below, a multi-lane road is flanked by greenery and lined with trees. The image appears to be taken on a clear day with even lighting, showing a clean and organized layout. The atmosphere is calm and functional, reflecting a well-designed public space. The bright colors and structured design give the area a lively yet orderly feel."
    },
    {
        "satellite-view/0113/0.png": "This is an aerial image of a waterfront area with a mix of natural and developed spaces. At the center, there is a circular structure with a water feature or fountain in the middle, surrounded by a paved walkway and greenery. To the left, a river or large body of water flows past a curved blue and white bridge. On the right, there is a row of houses with reddish-brown roofs and lush green trees between them and the central area. The background shows more green, with small pathways winding through the vegetation. The image is taken under clear, bright daylight, giving the scene a calm and orderly appearance. The overall atmosphere is peaceful and well-organized."
    },
    {
        "satellite-view/0114/0.png": "This is an aerial image of a waterfront area with a mix of buildings and green spaces. In the center, there is a large dark water body, possibly a lake or pond, surrounded by paved walkways and patches of green grass. To the left, several buildings with flat roofs are visible, some with red accents, while a long row of trees lines a road below. On the right, a curved shoreline wraps around the water, with a circular structure near the bottom edge that looks like a small park or plaza. The water appears calm, and there is no visible movement on land or in the water. The sky is overcast, casting soft, even light over the scene, giving it a quiet and calm atmosphere. The overall impression is of a peaceful urban park space adjacent to a lake, with no people or vehicles visible."
    },
    {
        "satellite-view/0115/0.png": "This is an aerial image of a quiet lakeside area with a small cluster of buildings. In the center, a group of houses is surrounded by green trees and grass. A narrow road curves around the water, connecting to a small dock that extends into the lake. To the left, a rectangular patch of land with reddish sand sits near the edge of the water. The water appears dark and still, with patches of green vegetation floating on its surface. The surrounding landscape is mostly natural, with dense shrubs and small trees. The scene is calm and peaceful, with soft light suggesting either early morning or late afternoon. The weather seems clear, and the overall impression is one of quiet seclusion."
    },
    {
        "satellite-view/0116/0.png": "This is an aerial image of a modern architectural complex near a body of water. The central object is a large, uniquely shaped building with a curved, white facade and cylindrical sections, resembling a wave or spiral. To the left of the building, there is green parkland with winding pathways and trees. On the right side, a small plaza with a red and white circular design is visible, surrounded by additional green space and a curved road. The water around the site appears calm and dark. The lighting in the image is even and clear, suggesting a day with bright, untaken weather. The overall scene feels clean, organized, and contemporary, with no signs of human activity present."
    },
    {
        "satellite-view/0117/0.png": "This is an aerial image of a modern architectural complex surrounded by green space and urban infrastructure. At the center is a unique building with circular and curved structures, resembling a series of interconnected domes or water tanks, set within a landscaped area. To the left, there’s a large grassy field bordered by a paved path with a series of circular patterns, likely designed for walking or aesthetic purposes. A parking lot with neatly arranged spaces stretches below the green area. To the right, a road runs parallel to the complex with trees lining its edge. The overall atmosphere is clean and orderly, with bright, even lighting indicating a clear day. The image captures a harmonious blend of nature and contemporary design."
    },
    {
        "satellite-view/0118/0.png": "This is an aerial image of a modern building complex surrounded by water and green spaces. In the center is a large structure with a sleek, curved roof that reflects the sky, resembling a wave or sail. To the left, a circular pond and small paths lead to a landscaped area with trees and bushes. On the right, parking lots, roads, and a few smaller buildings are visible, with red pathways connecting different zones. A paved walkway meanders along the edge of the water, and there are various shapes filled with greenery and colorful sections, possibly for recreation. The scene is clear and well-lit, suggesting a sunny day with no clouds, creating a clean and organized atmosphere. The overall layout appears carefully planned, blending nature and architecture under bright daylight."
    },
    {
        "satellite-view/0119/0.png": "This is an aerial image of a narrow island surrounded by water, with a mix of modern and traditional buildings. In the center, a calm river flows through, flanked by green trees and walking paths. On the left side, there are several rows of red-roofed apartments, appearing orderly and quiet. To the right, the island features tightly packed older-style houses with dark tiled roofs, some showing signs of age but still well-maintained. A small bridge connects the island to the mainland, where more buildings and roads are visible in the upper left. A few parked cars are seen near the houses, and a round pond lies in the middle of the island, adding a peaceful touch. The sky is clear with bright sunlight, casting soft shadows. The overall atmosphere is calm and serene, like a quiet residential area nestled between the water."
    },
    {
        "satellite-view/0120/0.png": "This is an aerial image of a modern sports and recreation complex. On the right side of the image is a large outdoor stadium with a red running track and a green football field, bordered by white seating stands. To the left, a series of interconnected lakes and green spaces form a park-like environment, with winding red pathways connecting different areas. A large white structure, possibly a dome-shaped building, occupies the bottom foreground. The area is well-maintained, with clear roads and landscaping. The weather appears clear and bright, with no visible shadows, suggesting midday sunlight. The overall layout is organized and balanced, giving the impression of a quiet, planned urban space dedicated to sport and leisure."
    },
    {
        "satellite-view/0121/0.png": "This is an aerial image of a modern campus or institutional complex. At the center is a large circular courtyard surrounded by a white curved building, which appears to be a main hall or auditorium. The central area is paved with light-colored stone and features a patterned ground design. Green trees and shrubs are planted around the courtyard, creating a lush, enclosed space. To the left of the center, there is a large dark pond, and adjacent to it are several lower buildings with dark roofs. On the right side of the image, white rectangular buildings with green-topped tennis courts are visible. A road runs along the far right edge, and a line of green trees separates the complex from the surrounding area. The weather is clear, with bright, even sunlight and no visible clouds. The scene has a structured, calm, and orderly appearance."
    },
    {
        "satellite-view/0122/0.png": "This is an aerial image of a school campus. In the center, there is a main building with a long, flat roof, surrounded by smaller structures. To the left, several rectangular buildings with light-colored roofs are arranged in a neat row. A paved area with green trees and shrubs lies between the buildings. To the right, there is a large sports field with a red running track encircling a green grass field, and next to it, a tennis court with markings. A road runs along the bottom of the image, with a few visible vehicles. The sky appears clear, casting even daylight over the scene. The overall atmosphere is orderly and structured, typical of an educational facility."
    },
    {
        "satellite-view/0123/0.png": "This is an aerial image of a sports and recreational complex. In the center, a large oval-shaped track with a green field inside dominates the view. To the left, there are two tennis courts surrounded by greenery, and below them, a circular building with a brown roof and glass walls. A monument-like sculpture with a golden top sits in a plaza near the top left. The area is surrounded by buildings, trees, and paved paths. The image appears to be taken on a clear day, with bright sunlight casting short shadows. The overall atmosphere is calm and open, reflecting a well-organized community space."
    },
    {
        "satellite-view/0124/0.png": "This is an aerial image of a modern urban area featuring a calm, dark lake at the center, surrounded by lush green trees. To the left of the lake, a curved walkway leads toward a white circular structure, possibly a pavilion or observation deck. On the right, several rectangular buildings with flat roofs are connected by covered walkways, forming a cohesive architectural complex. A bridge crosses over the lake, linking the buildings to the green space. The overall scene is clean and organized, with neatly arranged pathways and landscaping. The weather appears clear with bright, even lighting, suggesting a sunny day, giving the area a peaceful and structured atmosphere. The landscape is well-maintained, reflecting a balance between nature and urban design."
    },
    {
        "satellite-view/0125/0.png": "This is an aerial image of a school complex. In the center, several large, rectangular buildings with dark roofs are arranged around open courtyards and walkways. To the right, there is a red running track with a green field at the center, surrounded by a few smaller sports areas. On the left, a calm river flows beside the campus, bordered by trees and grass. A wide road runs along the right edge, with a few parked cars visible along the side. The scene appears clear and bright under a sunny sky, giving the area a clean and orderly look. The overall atmosphere is calm and structured, with no visible people, suggesting a quiet time of day. The neat design and open spaces reflect a well-planned educational environment."
    },
    {
        "satellite-view/0126/0.png": "This is an aerial image of a large, open cultural or historical site surrounded by dense green trees. In the center, there is a main courtyard area with a large rectangular lawn and a paved walkway, flanked by rows of small trees. On the left side, a complex of traditional buildings with dark roofs and light walls forms a symmetric layout, possibly a museum or shrine. A small, clear water feature lies on the right, near a modern parking lot and a road with moving cars. The site sits within a forested landscape, with winding paths and forested hills visible in the periphery. The sunlight is bright and evenly spaced, creating clear shadows and highlighting the contrast between the natural green surroundings and the patterned human structures. The atmosphere is orderly and calm."
    },
    {
        "satellite-view/0127/0.png": "This is an aerial image of a park surrounded by residential houses and greenery. In the center, there is a circular arrangement of white dome-like structures, possibly pavilions or sculptures, grouped around a patterned stone plaza. Nearby, several small ponds with curved edges reflect the surrounding trees. A paved path winds through the area, connecting different sections. To the left, a river flows along the edge, separating the park from a neighborhood with red-roofed homes. On the right, dense trees form a natural border, with a small sports field visible. The scene is bright and clear, suggesting a sunny day. The overall atmosphere is calm and orderly, reflecting a peaceful integration of nature and built space."
    },
    {
        "satellite-view/0128/0.png": "This is an aerial image of a complex of buildings surrounded by green trees and a river. In the center, there is a large, long building with a flat roof and several smaller sections connected by covered walkways. To the left, a river winds through the landscape, bordered by dense trees. On the right, a red running track curves around what appears to be a sports field. The area is quiet, with no visible people or movement, giving it a calm and orderly appearance. The sky is clear, and the sunlight creates sharp shadows, indicating a bright day. The mix of natural and man-made elements gives the scene a balanced and peaceful atmosphere."
    },
    {
        "satellite-view/0129/0.png": "This is an aerial image of a large modern complex with prominent architectural structures and surrounding greenery. At the center is a circular building with a tiered, stepped design, resembling a theater or arena, surrounded by a paved courtyard. To the left of this central structure is a large oval-shaped building with a dome, possibly a stadium or exhibition hall. On the right side of the image, there are multiple rows of parking lots filled with vehicles, and a long rectangular building with a white roof. The entire area is framed by trees and landscaped green spaces, with roads and pathways connecting the sections. The sunlight is clear and bright, casting sharp shadows and enhancing the geometric patterns of the buildings and grounds. The scene appears organized and functional, with a sense of symmetry and order."
    },
    {
        "satellite-view/0130/0.png": "This is an aerial image of a building complex surrounded by green trees and water channels. The central object is a large, light-colored building with a flat roof and several smaller structures connected to it. A parking area with vehicles is located in front of the building. To the left, there are more trees and a visible road with some traffic. On the right side, a long, narrow canal curves through the greenery. Above the complex, a highway runs parallel to the water. The scene appears calm and orderly, with clear sunlight illuminating the area and no visible clouds. The overall atmosphere is peaceful and structured, highlighting the contrast between urban development and natural elements. The image captures a balanced mix of nature and infrastructure in a quiet urban setting."
    },
    {
        "satellite-view/0131/0.png": "This is an aerial image of a modern urban area featuring a wide road and large paved spaces. In the center, a long, straight road runs diagonally, flanked by green trees and symmetrical landscaping. To the right, a prominent building with a curved, wave-like roof stands out, surrounded by circular garden beds and stone pathways. On the left, a large open plaza includes a patterned ground and a red-tiled area, possibly for public events. The scene is clean and well-organized, with smooth surfaces and evenly spaced trees. The lighting suggests a clear day with bright sunlight, casting short shadows. Overall, the area appears calm and orderly, reflecting a contemporary city design."
    },
    {
        "satellite-view/0132/0.png": "This is an aerial image of an urban area with buildings, roads, and green spaces. In the center, a large building with a flat roof and multiple sections stands out, surrounded by paved lots and parked vehicles. To the left, a wide road with light traffic runs parallel to a smaller street that curves through a park-like area with trees. On the right, a round, structure with a circular opening and surrounding greenery is visible. A modern building with a glass facade appears in the lower left corner. The scene is bright and clear, suggesting a sunny day. The layout shows a mix of architectural styles, with trees providing contrast to the concrete and asphalt. Overall, the area appears orderly and functional."
    },
    {
        "satellite-view/0133/0.png": "This is an aerial image of a suburban area with a clear intersection of roads. In the center, a wide street crosses a smaller road, forming a T-junction surrounded by green trees. To the left of the intersection, residential buildings with red-tiled roofs are nestled among lush greenery, while to the right, a row of dark-roofed houses lines the road. A large white building with a flat roof is visible in the top-right corner, possibly a commercial or community structure. On the left side, part of a water body is seen near a road, giving a sense of calm. The landscape includes small gardens and paved paths, adding to the orderly feel of the neighborhood. The scene appears to be captured on a clear day, with consistent lighting and no signs of rain or fog. The colors suggest a healthy, leafy environment."
    },
    {
        "satellite-view/0134/0.png": "This is an aerial image of a green, park-like area beside a large body of water. In the center, there is a complex of buildings surrounded by trees and landscaped gardens with winding paths. To the left, the water is calm and wide, with a narrow road running along the edge, bordered by a row of green trees. On the right, large solar panel arrays are visible, alongside a few modern white buildings. The scene looks peaceful and well-organized, with the mix of nature and technology creating a balanced settlement. The lighting suggests a bright, clear day with no clouds, casting soft shadows and giving the image a calm and clean atmosphere."
    },
    {
        "satellite-view/0135/0.png": "This is an aerial image of a large modern building complex surrounded by greenery and roads. The central structure is a multi-level complex with a flat roof and numerous windows, possibly a cultural or entertainment center. To the left, there is a circular building with a dome, connected by walkways. Further left, a large curved building with a glass roof and a prominent circular courtyard is visible. On the right, tree-lined streets run parallel to each other, with smaller buildings and parked cars. The scene is taken during the day under clear skies, with bright sunlight casting sharp shadows. The layout appears organized, with open spaces and green areas contributing to a calm and structured environment."
    },
    {
        "satellite-view/0136/0.png": "This is an aerial image of a riverside area with natural and man-made features. In the center, a circular structure with tiered levels sits on a hill covered in green trees and shrubs. To the left, a cluster of buildings, including a large light-colored house and smaller structures, is surrounded by more greenery and a few parked cars. A rough path winds through the trees and down toward the riverbank. On the right side, the wide river flows calmly, with two long barges floating nearby, one slightly ahead of the other. The sky is clear and bright, suggesting a sunny day. The overall mood is peaceful and slightly remote, with a calm, quiet atmosphere."
    },
    {
        "satellite-view/0137/0.png": "This is an aerial image of a park area near a body of water. In the center-right of the image, there is a large circular plaza with a distinctive statue or monument at its heart, surrounded by steps and pathways. To the left, a wide road runs parallel to the water, with some vehicles visible and buildings nearby. Lush green trees and walking paths fill the left and lower parts of the frame, creating a natural contrast with the paved areas. A small bridge connects across the water towards the far shore. The overall scene appears calm and orderly, with no signs of rain or fog, suggesting a clear day with even lighting. The view offers a peaceful blend of nature and urban design, subtly emphasizing the harmony between the built environment and the natural landscape."
    },
    {
        "satellite-view/0138/0.png": "This is an aerial image of a modern architectural complex surrounded by greenery. The central object is a large curved building with a white, segmented roof, connected to a circular structure with a grid-like dome. To the left, a tilted dome-like structure with a white exterior stands out. Around the buildings, there are parking lots with scattered vehicles and narrow roads winding through the area. Lush green trees and grassy patches are spread across the scene, creating a natural contrast with the clean lines of the buildings. The sky is clear and bright, suggesting sunny weather. The overall atmosphere is calm and orderly, with a balanced mix of nature and modern design. The image captures a quiet yet dynamic urban landscape."
    },
    {
        "satellite-view/0139/0.png": "This is an aerial image of a large urban complex. The central object is a modern building with a flat roof and a glass-covered section, likely a cultural or civic center. To the upper part of the image is a circular structure with a green dome, possibly a planetarium or museum, surrounded by landscaped greenery. On the left, a wide road carries traffic, with sidewalks and some parked cars. The area is bordered by trees and smaller buildings, indicating a mix of urban and natural elements. The weather appears to be clear, with bright sunlight casting sharp shadows, enhancing the geometric clarity of the structures. The overall scene feels organized and functional, reflecting a well-planned city layout. There is no sign of rain or fog, and the atmosphere is calm and orderly."
    },
    {
        "satellite-view/0140/0.png": "This is an aerial image of a park area next to a busy street. In the center-left, there is a green space with many trees and a large, light-colored circular structure that resembles a fountain or monument. To the right, a road runs vertically with cars moving along it, and buildings are visible at the edge of the frame. The road has traffic signals and streetlights. On the far right, modern buildings with glass windows stand near the road. A small field with sparse grass appears in the bottom-right corner. The scene is clear with no signs of rain or fog, suggesting a sunny day. The overall atmosphere is calm and organized, reflecting a well-maintained urban area."
    },
    {
        "satellite-view/0141/0.png": "This is an aerial image of a city intersection surrounded by green spaces and buildings. At the center, a four-way road splits into wide lanes, with a few vehicles visible on the streets. To the left, a large structure with a dark roof and a green field stands near a parking lot. On the right, a long row of trees lines a broad sidewalk beside a large, manicured lawn and a curved water feature. A straight canal runs parallel to the left road, bordered by trees and shrubs. The scene appears calm and orderly, with open areas and clean paths. The lighting suggests a clear day, with bright sunlight casting short shadows, giving the area a clean and structured look. The overall impression is one of quiet urban planning."
    },
    {
        "satellite-view/0142/0.png": "This is an aerial image of an urban area with a mix of green spaces, roads, and buildings. At the center is a large circular structure, resembling a stadium or arena, surrounded by trees and paved paths. To the left, there is a sports field with a red track and a tennis court. Above it, a parking lot with several cars is visible. On the right, modern buildings and a wide road with light traffic are seen. A body of water runs along the bottom right corner. The image is clear and well-lit, showing a tidy and organized environment. The overall mood is calm and structured, typical of a planned city area."
    },
    {
        "satellite-view/0143/0.png": "This is an aerial image of a modern urban complex with a mix of greenery and architecture. At the center is a large, curved building with a glass facade, surrounded by a wide open plaza filled with parked cars. To the left, there are two orange tennis courts, partially shaded by tall trees. A paved walkway runs near the tennis courts, leading toward the central structure. In the lower left corner, a long building with a slanted roof has a grid of solar panels on its roof. A winding road curves around the scene, passing between the buildings and the green areas. The area appears sunlit and clear, with no signs of rain or fog. The mix of open space, nature, and modern design gives the location a calm and orderly feel."
    },
    {
        "satellite-view/0144/0.png": "This is an aerial image of a campus-like area with symmetrical buildings and pathways. In the center, there are multiple rectangular buildings with brown rooftops, surrounded by open green spaces and paved walkways. To the left, a set of buildings forms a row along a street, while on the right, a curved waterway runs alongside the structures. A beige structure with a flat roof sits near the middle, adjacent to an open courtyard. A crosswalk crosses the road near the bottom, and a few vehicles are visible. The area appears quiet and organized, with clear shadows indicating a sunny day. The overall atmosphere is calm and structured, suggesting a peaceful academic or residential zone."
    },
    {
        "satellite-view/0145/0.png": "This is an aerial image of an amusement park. In the center, there is a large water play area with a colorful mural on the ground and a yellow slide. To the left, there is a white circular structure, possibly a Ferris wheel, surrounded by green grass and trees. Nearby, a path with a red roofed building and a small pool can be seen. On the right side of the image, there is a roller coaster track with a train moving along it, and a blue and white section of the park is visible below. A canal with calm water runs along the bottom right corner, separated by a pedestrian walkway. The park is full of greenery, with trees lining the pathways and hills covered in grass. The weather appears clear with bright sunlight, casting soft shadows across the landscape, giving the scene a bright and inviting atmosphere."
    },
    {
        "satellite-view/0146/0.png": "This is an aerial image of a park-like area with a winding river and a small concrete bridge crossing it. In the center of the image, the river flows through two curved banks covered with green trees and patches of dry grass. On the left side, there is a path winding through mowed lawns and hedges, with a few small buildings or shelters near the edge. A large open area with bare soil or construction material is visible further left. On the right side of the river, more trees and a few scattered buildings, including a white building with a red roof, are present. The scene is gently lit, suggesting a cloudy or overcast day with no strong shadows. The overall mood is calm and quiet, without any signs of people or activity."
    },
    {
        "satellite-view/0147/0.png": "This is an aerial image of a mixed-use area featuring modern buildings, roads, and a small green space. In the center, a bright green tennis court sits within a paved enclosure, surrounded by grass and trees. To the left, a wide river flows alongside a multi-lane road with clear traffic lines and overpasses. On the right, dark-roofed buildings with traditional architectural elements are arranged around parking areas. The scene is captured under clear daylight, with sharp shadows and bright colors, suggesting a sunny day. The overall layout appears organized and functional, with clean lines and open spaces, giving a calm and structured impression."
    },
    {
        "satellite-view/0148/0.png": "This is an aerial image of a modern campus centered around a large circular building with a glass roof, resembling a library or auditorium. The structure sits at the heart of a symmetrical layout, surrounded by wide concrete pathways that radiate outward. To the left and right of the central hub are smaller buildings with flat roofs, possibly classrooms or administrative offices, flanked by landscaped areas with trees and grass. On the far left and right, residential-style buildings are visible, forming the edges of the complex. A wide-open green lawn stretches below, marked by a cross-like pattern of paths. The whole scene is captured under clear, bright daylight, with a calm and orderly atmosphere. The surrounding green water adds a peaceful boundary, enhancing the sense of openness and design."
    },
    {
        "satellite-view/0149/0.png": "This is an aerial image of a campus or cultural complex featuring a distinctive central building surrounded by water and pavement. The central structure is a circular tower with a red-tiled roof and a blue dome at its apex, standing out against the more rectangular buildings nearby. To the left of the tower, a large green lake curves around the landscape, bordered by grassy banks and trees. A curved walkway runs along the lake’s edge, leading toward the central building. To the right, other buildings with flat roofs and modern design frame the scene. The sky appears clear and sunny, casting sharp shadows that suggest bright daylight. The overall atmosphere is calm and structured, with a sense of order and symmetry throughout the layout."
    },
    {
        "satellite-view/0150/0.png": "This is an aerial image of a small rural village beside a winding river. On the left, clusters of houses with dark roofs are closely packed together, surrounded by patches of green fields and trees. The river flows through the center, its surface calm and dark, reflecting a slight shadow from above. To the right, large agricultural fields stretch out in neat rows, some brown and dry, others green and lush. The landscape appears calm and still, with no signs of people or vehicles. The weather seems clear and bright, with no clouds visible, and the image gives a peaceful and quiet impression of countryside life."
    },
    {
        "satellite-view/0151/0.png": "This is an aerial image of a rural area with a mix of farmland and infrastructure. In the center, there is a construction site with piles of materials and machinery, indicating ongoing development. To the left, several rectangular plots of land are visible, some covered with green crops and others appearing as dark soil, likely used for farming. A narrow road runs alongside these fields. On the right side of the image, a wide highway with multiple lanes stretches vertically, showing signs of traffic. The surrounding landscape is lush with green vegetation, suggesting recent rainfall. The weather appears overcast, with soft, diffused light and no shadows, giving the scene a calm and muted atmosphere. There are no people or vehicles visible, contributing to a sense of quiet isolation. The contrast between the natural farmland and the modern highway highlights the intersection of rural life and urban expansion."
    },
    {
        "satellite-view/0152/0.png": "This is an aerial image of a large curved structure, possibly a reservoir or part of a dam, situated in a landscaped area. The central object is a long, arched building with a dark roof, supported by several pillars, and surrounded by a series of concentric terraced slopes. To the left, a network of roads and patches of green vegetation can be seen, along with what appears to be a parking area and smaller buildings. On the right, more green spaces and scattered trees are visible. The ground is mostly bare earth with some areas of grass and small shrubs. The image is taken under clear conditions, with bright, even lighting and no signs of clouds or rain. The scene appears calm and orderly, with no visible people or movement."
    },
    {
        "satellite-view/0153/0.png": "This is an aerial image of a suburban neighborhood beside a winding river. The river flows from the top left to the bottom right, curving through the scene with calm, brownish-green water. On the left side, a row of houses with gray roofs and light-colored walls lines the riverbank, giving the area a quiet and orderly feel. To the right, a park with scattered trees and shrubs spreads across the land, including a small pond and walking paths. A narrow dirt trail meanders through the greenery. Some buildings and pavilions appear within the park, adding small architectural details. The atmosphere feels peaceful and serene, with soft natural lighting suggesting a calm day. There are no signs of rain or fog, just clear visibility across the landscape."
    },
    {
        "satellite-view/0154/0.png": "This is an aerial image of a modern campus or complex with a central green space. In the center, there is a circular garden with trees, pathways, and curved walkways forming a symmetrical layout. Surrounding this green area are several long, rectangular buildings with flat roofs, some topped with solar panels, indicating a focus on sustainability. To the left, a red track and green sports fields are visible, while below, a large indoor arena with a blue roof stands out. On the right, a series of smaller buildings and a curved road can be seen. The scene is well-lit, suggesting a sunny day with clear visibility. The overall atmosphere is calm and orderly, reflecting a well-planned urban environment. The mix of greenery and modern architecture creates a balanced and functional setting."
    },
    {
        "satellite-view/0155/0.png": "This is an aerial image of an urban area with a mix of buildings and green spaces. In the center, there is a large rectangular building with a flat roof, surrounded by smaller structures. To the left, a winding river flows alongside a lush green corridor, with patches of land showing different shades of green. On the right, a parking lot with several vehicles is visible, along with roads and some trees. The scene is viewed under clear weather, with no clouds or rain, giving the image a bright and open feel. The layout suggests a functional zone, possibly a business or industrial park, blending man-made shapes with natural elements. The overall atmosphere is calm and organized."
    },
    {
        "satellite-view/0156/0.png": "This is an aerial image of a large campus or institutional complex. In the center, there is a long building with a unique curved design, surrounded by green spaces and trees. The building is made of light-colored materials and has many windows. To the left, a wide paved area stretches out with parking lots and a few smaller structures. To the right, a wide road runs parallel to the building, with cars parked along the sides and traffic moving in both directions. Further right, there is a large empty field, possibly for sports. The image appears to be taken on a sunny day, with clear shadows on the ground. The overall scene is orderly and calm, featuring a mix of natural and built environments."
    },
    {
        "satellite-view/0157/0.png": "This is an aerial image of a modern urban area with a mix of buildings, green spaces, and waterways. At the center is a large complex with multiple angular structures and a colorful circular play area, possibly a children's park. To the left, a river curves along the edge of the scene, bordered by trees and a small road with a few cars. On the right, a wide road stretches vertically, lined with vehicles and a roundabout. A large open field appears in the background, covered in green crops or grass. The scene is bright and clearly lit, indicating a sunny day with no visible clouds. The overall atmosphere is calm and clean, reflecting a well-planned city space."
    },
    {
        "satellite-view/0158/0.png": "This is an aerial image of a calm urban area with a river running through it. The river flows from the top left to the bottom right, flanked by green trees and patches of greenery. On the right side of the river, there are several buildings, including older, low-rise structures and some larger, modern warehouses with flat roofs. A few parking areas with cars can be seen between the buildings. On the left side, there are more compact buildings, possibly residential, with protected rooftops and narrow alleyways. The shot appears to have been taken on a cloudy day, with soft light and no harsh shadows. The atmosphere is quiet and slightly gray, typical of an overcast morning in a moderately populated city. The overall scene feels peaceful and orderly, with nature integrating smoothly into the urban landscape."
    },
    {
        "satellite-view/0159/0.png": "This is an aerial image of an industrial area with green spaces and roads. In the center, there is a large green field with a path winding through it, surrounded by trees and bushes. To the left, a busy highway with multiple lanes runs vertically, with vehicles moving steadily. On the right, several long rectangular buildings with flat roofs, possibly warehouses or factories, are arranged in a grid. Some structures have green roofs, blending with the surrounding nature. A smaller building with a white roof is near the central green area. The scene is bright and clear, lit by sunshine, with no clouds visible. The atmosphere appears calm and orderly, highlighting a mix of urban development and open green space."
    },
    {
        "satellite-view/0160/0.png": "This is an aerial image of a modern architectural complex. In the lower left, there is a large dome-shaped building with a textured, mesh-like surface. To the right, a massive white dome with small dark spots stands prominently. Between them, a paved plaza with green trees and paths connects the structures. On the far right, a grassy area bordered by a curved walkway and a building with a cylindrical tower is visible. A road with vehicles runs along the bottom edge, crossing a green space. The scene appears clear and well-lit, suggesting a sunny day. The layout is neat, with a balanced mix of open spaces and geometric forms. The overall atmosphere is orderly and calm."
    },
    {
        "satellite-view/0161/0.png": "This is an aerial image of a riverside area with a mix of natural and man-made features. On the left, a wide river flows calmly, its surface slightly rippled, bordered by a concrete embankment. Along the river, a narrow path runs parallel, leading into a lush green park filled with trees and shrubs. A winding road cuts through the greenery, bordered by patches of dirt and mown grass. There is a large, rectangular, reddish-brown open space in the center, possibly a sports field or construction site, with equipment or vehicles faintly visible. To the bottom right, a paved road or platform stretches horizontally, possibly a parking lot or access area. The scene appears calm and orderly under bright daylight, with no people or vehicles in motion, giving a quiet and well-maintained atmosphere."
    },
    {
        "satellite-view/0162/0.png": "This is an aerial image of a riverside area with a mix of natural and man-made structures. In the center, a winding path cuts through lush green trees and open grassy spaces. To the left, a wide river flows gently, bordered by a concrete embankment and a few small boats docked at a pier. A white passenger vessel is visible near the pier, adding a touch of activity. On the right, modern buildings with flat roofs stand alongside the green area, and a series of parking lots with scattered cars appear below. The weather is clear, and the lighting suggests a slightly overcast day, casting soft shadows. The scene feels balanced and calm, with the quiet greenery contrasting with the nearby urban landscape."
    },
    {
        "satellite-view/0163/0.png": "This is an aerial image of a large, symmetrical building complex with a layered, tiered design, resembling a stepped pyramid. The central structure is surrounded by green spaces, including trees and landscaped areas. To the left and right, roads and pathways are visible, with some vehicles moving along the streets. A wide road runs along the top edge of the image, leading toward an urban area in the background. The image is clear and well-lit, suggesting a sunny day with sharp shadows indicating bright sunlight. The colors are vivid, with red and gray tones dominating the building and green from the surrounding vegetation. The overall atmosphere is calm and orderly, reflecting a well-planned city space."
    },
    {
        "satellite-view/0164/0.png": "This is an aerial image of a large industrial complex surrounded by greenery and waterways. In the center, several long, white buildings with flat roofs are arranged in a layout that suggests they are part of a factory or warehouse facility. A narrow canal runs through the middle, acting as both a divider and a feature in the landscape. To the left, there are patches of dense green vegetation and a small structure partially covered by trees. On the right, a road runs parallel to the canal, showing faint traffic lines. A bridge crosses the water, connecting the two sides. The area appears neatly maintained, and the overall scene is calm and orderly, with natural light showing clear visibility and no signs of rain or fog."
    },
    {
        "satellite-view/0165/0.png": "This is an aerial image of a large urban area with a mix of residential and commercial buildings. In the center, there is a large modern structure with a flat roof and two dome-like features, surrounded by paved surfaces and parked cars. To the left, rows of houses with red tile roofs are arranged in a grid pattern, bordered by green trees and small gardens. On the right, a broad waterway flows alongside the area, with a road running parallel to it. Trees and green spaces are scattered throughout, creating a contrast with the built environment. The scene is captured in daylight with clear visibility, showing no signs of rain or fog. The overall atmosphere is calm and orderly, reflecting a well-planned city layout."
    },
    {
        "satellite-view/0166/0.png": "This is an aerial image of a modern waterfront area. In the center is a large rectangular building with a flat roof and several domed sections, surrounded by a wide paved courtyard. To the right of the building is a calm body of water, with a small red-roofed structure on a small island or dock within it. The left side of the image shows a residential neighborhood with green trees and rows of houses. Along the bottom edge, a tree-lined road runs parallel to the water. The sky is clear, and the sunlight is bright, casting soft shadows. The scene appears peaceful and structured, with a mix of natural and built elements. The overall impression is one of order and quiet city life."
    },
    {
        "satellite-view/0167/0.png": "This is an aerial image of a modern urban area featuring a large, circular building surrounded by green spaces and roads. At the center is a prominent round structure with a ring of trees and a central opening, resembling a futuristic architectural design. To the left, a tall glass-clad tower rises beside the building. Around the main complex, curved roads with moving vehicles connect to a parking area marked by multiple rows of cars. On the right, residential neighborhoods with rows of houses and green trees are visible. In the lower right, a waterway curves through landscaped areas. The sky is covered by light clouds, giving the scene a soft, even light, with no harsh shadows. The overall impression is of an organized, well-planned city development blending technology and nature."
    },
    {
        "satellite-view/0168/0.png": "This is an aerial image of a modern architectural complex surrounded by green space and water features. At the center stands a large building with a dark roof and geometric design, featuring sharp angles and layered structures. To the left, a rectangular courtyard with a central garden displays neatly arranged pathways and small trees. On the right, smaller buildings with flat roofs and white walls form a quieter section of the site. Near the top, a series of tennis courts and a running track are marked by bright green surfaces. A narrow waterway winds along the bottom edge, bordered by lush grass and trees. The area appears calm and well-maintained, with a balance of built and natural elements under clear daylight."
    },
    {
        "satellite-view/0169/0.png": "This is an aerial image of a traditional-style complex surrounded by water and greenery. On the left, a calm lake with a curved bridge extends into the frame, while a smaller bridge crosses a narrow waterway near the center. The main structure consists of several buildings with dark, sloped roofs, arranged in a cluster on the right. These buildings are enclosed by lush trees and shrubs, giving the area a peaceful and well-organized look. A paved path runs alongside the water, winding around the buildings. The scene appears on a clear day, with natural sunlight illuminating the landscape, creating soft shadows and highlighting the green foliage. The overall atmosphere is serene, suggesting a quiet retreat or cultural site."
    },
    {
        "satellite-view/0170/0.png": "This is an aerial image of a traditional-style architectural complex surrounded by greenery and water. The central building features a large courtyard with stone paving and is surrounded by symmetrical structures with curved gray rooftops, typical of classical Chinese design. To the left, there are more modern buildings with flat roofs and a grid-like street pattern. On the right and below, a gentle curve of a calm river or canal flows alongside the complex, enhancing the peaceful atmosphere. The area is filled with trees and landscaping, giving it a serene and well-maintained appearance. The lighting suggests a clear day with soft sunlight, casting gentle shadows. Overall, the scene feels quiet and harmonious, blending natural beauty with cultural heritage."
    },
    {
        "satellite-view/0171/0.png": "This is an aerial image of a park-like area with a modern building and a curved waterway. In the center, there is a large circular structure with a reddish-brown surface, possibly a dome or seating area, surrounded by gray paved walkways. To the left, a narrow canal runs through green trees and bushes, forming a natural path. On the right, a multi-level building with flat roofs and balconies stands near the main structure, with several smaller pavilion-like spaces around it. The area is well-organized, with clean lines and evenly spaced trees, giving it a calm and orderly appearance under clear daylight. There are no clouds, and the light is bright but not harsh, suggesting a peaceful day."
    },
    {
        "satellite-view/0172/0.png": "This is an aerial image of a campus-like area surrounded by greenery and a waterway. In the center is a large grassy field, likely used for sports or recreation, surrounded by trees and bordered by several buildings with dark roofs. To the right, a group of buildings includes a modern structure with solar panels on the roof and a section with two blue tennis courts. A narrow canal runs along the upper right, with a bridge connecting the land. On the left side, a wide road with multiple lanes cuts through, showing light traffic. The scene is bright and clear, suggesting a sunny day, with shadows indicating afternoon light. The overall layout feels organized and peaceful, blending natural and built environments harmoniously."
    },
    {
        "satellite-view/0173/0.png": "This is an aerial image of a modern architectural complex surrounded by greenery. In the center, a large, circular structure with a radial design stands out, resembling a sunburst. To the lower left, a building shaped like a flower with dark, curved petals and a central glass dome dominates the view. Around this structure, paved walkways form concentric rings, leading to the central plaza. To the right, a road with moving vehicles runs parallel to the complex, bordered by trees. The scene is bright and clear under daylight, with lush green trees framing the area. The overall mood is calm and orderly, reflecting a well-planned urban space."
    },
    {
        "satellite-view/0174/0.png": "This is an aerial image of a park-like area with a central circular structure surrounded by greenery and pathways. The central object is a round plaza with a patterned design and a small, possibly historical, monument or sculpture in the middle. To the left, a large body of water is bordered by a paved walkway. On the right, there are rectangular gardens covered with green plants, and a cluster of buildings including a flat-roofed structure. A road runs along the top edge, with a few vehicles moving along it. The trees and grass are lush, giving the area a calm and organized feel. The photo appears to be taken on a clear day with bright, even light, suggesting good visibility and no cloud cover. The overall atmosphere is peaceful and open."
    },
    {
        "satellite-view/0175/0.png": "This is an aerial image of a mixed-use area that includes a sports complex and surrounding buildings. In the center, there is a large sports field with multiple covered courts and a green field, bordered by a red running track on the right. The surrounding area features traditional-style buildings with dark roofs, interspersed with green trees and pathways. To the left, there are dense structures with flat roofs, probably residential, and along the bottom edge, a body of water runs parallel to the land. The image appears to be taken on a clear day with sunlight casting soft shadows. The scene gives a calm and orderly impression, with a balance between urban development and green space. The atmosphere is quiet and organized, with no visible people or movement."
    },
    {
        "satellite-view/0176/0.png": "This is an aerial image of a modern bridge over a calm river in an urban area. The bridge has a curved design with green spaces on its surface, featuring walkways and small gardens, creating a blend of nature and infrastructure. To the left of the bridge, a highway runs parallel to the river, with multiple lanes of traffic and a few cars visible. Along the riverbank, trees and green patches provide a natural contrast to the built environment. On the right side, a row of buildings, likely apartments or offices, sits close to the water. The scene is captured on a clear day with strong sunlight, casting sharp shadows and highlighting the bright colors of the landscape. The overall atmosphere is peaceful, with the bridge serving as a striking link between the two sides of the city."
    },
    {
        "satellite-view/0177/0.png": "This is an aerial image of a modern complex near a body of water. At the center is a large, dark-roofed building with angular shapes and flat sections, surrounded by green spaces and pathways. To the right, a lighter structure with a flat roof and open courtyards stands beside a tree-lined road. On the left, a smaller, rectangular building sits next to a patch of greenery. The area is bordered by rows of trees and bushes, with a calm dark waterway in the foreground. The scene is captured under clear, bright conditions, showing a well-organized layout that feels quiet and structured. The mix of green and built elements suggests a balance between nature and urban design."
    },
    {
        "satellite-view/0178/0.png": "This is an aerial image of a green urban area with water and roads. In the center, a bridge crosses a calm, dark river, connecting two sides of the land. A wide road runs under the bridge, with cars visible on the surface. To the left, there are parking lots filled with vehicles and a few buildings surrounded by trees. On the right side, dense greenery covers the banks of the river, and a large, modern structure with a glass-like roof sits near the water. The scene appears clear and bright, suggesting a sunny day with no clouds, shadows, or rain. The overall view is peaceful and well-organized, showing a mix of nature and urban layout."
    },
    {
        "satellite-view/0179/0.png": "This is an aerial image of a green park area surrounded by water. In the center, there is a large, well-maintained grass field bordered by a curved path. To the left, a concrete walkway connects to a bridge over the water, leading to a small red structure that looks like a covered pavilion. A set of circular paths with trees forms a plaza near the lower left, where red benches are visible. On the right, a paved road follows the edge of the green space, running alongside a large brown lot. The scene is captured on a clear day under bright sunlight, which enhances the vividness of the green grass and the dark water. The overall setting feels calm and open."
    },
    {
        "satellite-view/0180/0.png": "This is an aerial image of a highway intersection near a body of water. In the center, a multi-lane road crosses over another road with traffic visible, including cars and a white truck. To the left, smaller roads run parallel to the water’s edge, with a few buildings near the shoreline. On the right, patches of green land with cultivated plots are interspersed with trees and shrubs. The water appears calm and dark on the top left, bordered by a narrow strip of land with grass and pavement. The sky is overcast, casting a neutral light across the scene. There is no sign of heavy traffic or people, and the area has a quiet, purposeful feel. The overall image shows a mix of infrastructure and natural greenery under gray skies."
    },
    {
        "satellite-view/0181/0.png": "This is an aerial image of a bridge crossing a river in an urban area. The bridge has a modern design with white triangular structures supporting its roadway, which carries multiple lanes of traffic. To the left, there is a large curved road or highway with other structures nearby, possibly a parking lot or construction site. On the right side of the river, there is a green park area with trees and walking paths, and a few buildings can be seen in the distance. The river runs straight through the center, with calm water reflecting a bit of light. The scene is clear, with no clouds or fog, suggesting a bright day. The overall atmosphere is calm and orderly, showing a well-planned city landscape."
    },
    {
        "satellite-view/0182/0.png": "This is an aerial image of a modern urban development featuring a distinctive architectural complex. At the center are two large, circular structures with glass and metal exteriors, possibly part of a cultural or entertainment venue. To the right, a green football field with white markings is surrounded by a running track, and adjacent to it lies a rectangular building with a white roof. On the left, a curved waterway flows alongside a road with moving vehicles. A bridge crosses over the water, connecting different areas. The surrounding landscape includes patches of green trees and landscaped areas. The image shows clear weather with no visible clouds, providing a bright and unobstructed view of the layout and structures, which appear well-integrated into the city’s infrastructure. The overall atmosphere is static, reflecting a planning-focused urban environment."
    },
    {
        "satellite-view/0183/0.png": "This is an aerial image of a riverside area with a mix of buildings, roads, and green spaces. On the left, there are several structures, including a large white building with a flat roof, surrounded by roads and parking lots. A paved path runs along the riverbank, bordered by grass and trees. In the center, a long, low building with a sloped roof is visible, possibly a public facility or cultural center. To the right, the wide river flows calmly, reflecting a gray sky. The atmosphere is calm and orderly, with no visible people or vehicles. The weather appears overcast, giving the scene a soft, muted light. The overall mood is quiet and purposeful, with a sense of urban planning and nature working together."
    },
    {
        "satellite-view/0184/0.png": "This is an aerial image of a busy intersection in an urban area. At the center, a roundabout with a green space and trees is surrounded by roads with moving vehicles, including buses and cars. To the left, a river runs parallel to a road with a bridge crossing it. On the right, a wide road extends upward, bordered by green fields and trees. The lower part of the image shows a large building with a dark roof and nearby parking spaces. The scene is bright and clear, suggesting a sunny day with no clouds. The overall atmosphere is functional and organized, showing a well-developed city layout."
    },
    {
        "satellite-view/0185/0.png": "This is an aerial image of a sports and recreational complex. At the center is a large sports field with a green grass pitch surrounded by a red running track. To the right of the field is a wide road with a few vehicles passing by. On the left side, a circular paved area is surrounded by curved buildings, possibly for seating or events. Near the bottom, a smaller area contains blue-roofed structures, likely for indoor activities. Trees and small green spaces are scattered around, adding nature to the urban setting. Along the right edge, rows of trees line a forested slope. The scene is bright and clear, suggesting a sunny day with no clouds, giving the image a calm and open atmosphere."
    },
    {
        "satellite-view/0186/0.png": "This is an aerial image of a partially developed urban area. In the center, there is a large green space with trees and a dirt path forming a circular pattern. To the left, a wide highway with multiple lanes runs vertically, while below it, a smaller road intersects at a perpendicular angle. On the right, a curved waterway flows alongside a building complex with white rooftops, bordered by lush green vegetation. The surrounding landscape shows patches of greenery and open land, some partially paved. The scene is captured under clear daylight with no visible shadows or clouds, creating a calm and orderly atmosphere. The area appears quiet and structured, with natural elements contrasting alongside infrastructure."
    },
    {
        "satellite-view/0187/0.png": "This is an aerial image of a city area with a central building surrounded by green spaces and waterways. The main structure is a large, rectangular building with a dark, flat roof, enclosed by a gray wall and visible from above. It sits on land with trees and lawns, and is bordered on the left by a road with cars and a smaller white-roofed building. To the right, a wide canal runs vertically through the scene. On the left side, a narrow river flows near residential houses. The surrounding area mixes green parkland and built structures, with some homes in the upper right corner. The image is clear and well-lit, suggesting a sunny day with no clouds. The overall atmosphere is calm and orderly, giving a sense of quiet urban planning."
    },
    {
        "satellite-view/0188/0.png": "This is an aerial image of a green island surrounded by dark water, connected by a bridge to a nearby landmass. At the center, a large, lush green area stands out with dense trees and vegetation, resembling a natural park. On the right, a dark road cuts across the water, bridging the island to the land. To the left, a red-roofed structure sits near the water's edge, possibly a building or a pavilion. Below the island, clusters of urban structures, including low-rise buildings and parking lots, are visible, displaying a mix of residential or commercial use. The surroundings appear calm and peaceful, with little sign of movement or activity. The water is still and dark, suggesting a quiet day, possibly under overcast skies, creating a tranquil and reflective atmosphere. The overall view is balanced between nature and development, emphasizing a quiet coexistence."
    },
    {
        "satellite-view/0189/0.png": "This is an aerial image of a modern urban landscape featuring a curved road and landscaped green areas. On the left, a large building with a curved white roof and glass facade stands near a body of dark water. To the right, a roundabout leads to a wide, empty road. In the center, a circular patch of dark soil contrasts with the surrounding grass and trees. Small trees are scattered around the area, and the pavement is clean and well-maintained. The scene is quiet, with no visible people or vehicles, suggesting a peaceful moment in the day. The lighting is even and bright, indicating a clear day with no clouds. The overall mood is calm and orderly, typical of a well-planned city space."
    },
    {
        "satellite-view/0190/0.png": "This is an aerial image of a large, modern stadium with a distinctive white, ribbed roof that curves outward in a fan-like pattern. The stadium is situated in an urban area, surrounded by paved roads and buildings. To the right, a tall, dark skyscraper stands adjacent to the stadium, while a long, rectangular structure stretches alongside it. Green trees line the pathways around the stadium, adding contrast to the grey concrete and asphalt. In the background, additional low-rise buildings and roads form a grid. The weather appears clear, with bright sunlight casting distinct shadows, highlighting the clean and geometric design of the structures. The overall atmosphere is orderly and functional, typical of a major city's infrastructure."
    },
    {
        "satellite-view/0191/0.png": "This is an aerial image of a modern urban area centered around a large, angular building with a flat roof and a light-colored facade. The structure is situated on a concrete plaza with curved roadways and green patches of trees surrounding it. To the left, a multi-lane road with vehicles is visible, showing moderate traffic. On the right, part of a taller white structure appears, possibly another tower. A water body lies at the bottom edge of the image, with a small promenade beside it. The scene is captured under bright daylight with clear visibility, showing sharp contrasts and clean lines. The overall impression is of a functional, well-planned city environment with a mix of green space and infrastructure."
    },
    {
        "satellite-view/0192/0.png": "This is an aerial image of a large, circular stadium with a retractable roof, located in a landscaped urban area. The stadium features a bright blue swimming pool at its center, surrounded by white seating or walkways arranged in a radial pattern. To the left, there is a wide green lawn and a paved path that leads toward the structure. A dark expanse of water lies to the right, partially bordered by concrete and vegetation. In the lower-left corner, a sports field with a marked pitch is visible. The area around the stadium is well-organized, with roads, sidewalks, and trees adding structure to the environment. The weather appears clear, with bright lighting and minimal shadows, suggesting a sunny day. The scene gives a calm and orderly impression, showing a modern public facility integrated into a clean and open city space."
    },
    {
        "satellite-view/0193/0.png": "This is an aerial image of a green park area next to a large body of water. On the left, a calm, dark river curves alongside the park, bordered by a paved walkway with a red edge. In the center of the park, a long building with a grey roof stands among dense trees and grassy zones. A small paved area with a sloped dirt patch is nearby. To the right, a parking lot with white lines and several roads with moving vehicles are visible. A football field with white markings appears in the bottom-right corner. The scene is bright and clear, suggesting a sunny day, with no clouds or shadows indicating harsh light. The layout shows an organized mix of nature and urban infrastructure, giving a clean and peaceful atmosphere."
    },
    {
        "satellite-view/0194/0.png": "This is an aerial image of a modern sports and recreational complex. At the center, a large, white building with curved edges and multiple levels stands out, likely a gym or community center, surrounded by a network of paved roads and parking areas. To the left, a red and green basketball court and two blue tennis courts are clearly visible, nestled among green trees. On the right, a wide green field, possibly a soccer or football pitch, stretches toward the edge of the frame. The complex is bordered by a dark green, tree-filled area, and the nearby roads appear quiet, with only a few scattered vehicles. The scene is captured in clear daylight, with no clouds, giving the image a bright and open feel. The layout suggests a well-planned, functional space for community activities, with a balanced mix of recreation, transportation, and greenery."
    },
    {
        "satellite-view/0195/0.png": "This is an aerial image of a large public space near a body of water. In the center, a wide, curved gray plaza or paved area dominates, bordered by green grass and pathways. To the right, there is a road with sharp turns and a few buildings, including a long rectangular structure. On the left, the natural edge of the land meets the dark water, with a red paved walkway along the shore. A bridge or raised structure extends from the upper center toward the water, leading to a small dock area. The scene is calm and orderly, with strong geometric patterns formed by paths, roads, and the curved plaza. The weather appears clear, with no clouds or rain visible, and the lighting is bright and even, indicating daylight."
    },
    {
        "satellite-view/0196/0.png": "This is an aerial image of a modern bridge spanning a wide river. The bridge has a distinctive white structure with curved supports and carries multiple lanes of traffic, including cars and buses. To the right of the bridge is a large green field, likely a sports ground, with a red track around it and a soccer pitch in the center. A large barge is floating in the river, and several smaller boats are docked along the riverbank on the left. On the far left, a covered structure with a patterned roof suggests a transport or industrial facility. The scene appears to be under bright daylight, with clear shadows suggesting a sunny day. The overall atmosphere is calm and orderly, reflecting a well-planned urban landscape."
    },
    {
        "satellite-view/0197/0.png": "This is an aerial image of a park-like area with sports fields and water features. In the center, a large football field with green turf and white lines runs vertically, bordered by a smaller field to its left. To the right, a winding lake with dark water is surrounded by trees and a paved path, leading to a raised area with several slopes and paths. On the left side of the image, two white-roofed buildings sit near a parking lot. The park shows a mix of green grass, trees, and natural water, with a peaceful and organized layout. The lighting suggests a bright day with clear visibility, as there is no fog or rain, and shadows are sharp. The scene feels calm and well-maintained, with structured green spaces and walking paths."
    },
    {
        "satellite-view/0198/0.png": "This is an aerial image of a large educational campus situated beside a river. In the center are several buildings with flat roofs, connected by walkways, surrounded by green spaces and trees. On the left, a blue athletic track encircles a large grass field, with red and blue sports courts nearby. A river runs horizontally at the bottom, with a forested riverside and a highway in the foreground. The campus appears orderly and clean, with parked cars and small roads visible. The sky is clear and bright, casting shadows that show the time is likely midday. The overall atmosphere is calm and structured, suggesting a quiet academic environment. The image is taken from an angle, offering a wide, clear view of the layout."
    },
    {
        "satellite-view/0199/0.png": "This is an aerial image of a rural area with agricultural land and some buildings. In the center is a large rectangular field, brown and dry, possibly recently harvested or awaiting planting. To the left, green and reddish plots form a patchwork of farmland, divided by narrow paths and small ditches. Along the right side, a line of trees borders a cluster of gray-roofed houses. A narrow canal runs vertically along the middle, connecting different sections of the landscape. The overall scene is calm and still, with no signs of people or moving vehicles. The weather appears clear, as shadows cast by trees and buildings are distinct, suggesting bright daylight with no clouds or fog. The atmosphere is peaceful, typical of a quiet countryside."
    },
    {
        "satellite-view/0200/0.png": "This is an aerial image of a riverfront area with a long bridge crossing the water. The bridge has a red central section and connects two land areas. On the left, a large white building with a gray roof sits near the water’s edge, surrounded by green lawns and a reddish path. To the right, more buildings, roads, and patches of green trees are visible. Several boats are docked at the bottom right near the water. The weather appears clear and bright, with natural daylight casting soft shadows. The overall image shows a calm and organized urban landscape."
    }
]